{"request_params": {"q": "python", "l": "New York State", "jt": "contract", "start": 60}, "job_descriptions": ["$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$55 - $60 an hourPart-time, ContractJob Description: Responsible for developing, enhancing, modifying and/or maintaining applications in the Global Markets environment.Software developers design, code, test, debug and document programs as well as support activities for the corporate systems architecture.Typically requires 5-7 years of applicable experience.This job code is only to be used for associates supporting Global Markets.Strong technical developer with 10 years of development experience.Python and financial experience required. Strong problem solving skills and exposure to Agile methodologies.Central Funding Desk (CFD), derivatives, or Structured Notes experience desirable with understanding of Commodity products.Skillsets Required: Strong Python experience in a development platform like Quartz or Athena.Exposure to Front and Middle Office functions and controls.Strong verbal and written communication skills.Job Types: Full-time, Part-time, ContractSalary: $55.00 to $60.00 /hourExperience:Python: 7 years (Preferred)", "$55 - $60 an hourPart-time, ContractJob Description: Responsible for developing, enhancing, modifying and/or maintaining applications in the Global Markets environment.Software developers design, code, test, debug and document programs as well as support activities for the corporate systems architecture.Typically requires 5-7 years of applicable experience.This job code is only to be used for associates supporting Global Markets.Strong technical developer with 10 years of development experience.Python and financial experience required. Strong problem solving skills and exposure to Agile methodologies.Central Funding Desk (CFD), derivatives, or Structured Notes experience desirable with understanding of Commodity products.Skillsets Required: Strong Python experience in a development platform like Quartz or Athena.Exposure to Front and Middle Office functions and controls.Strong verbal and written communication skills.Job Types: Full-time, Part-time, ContractSalary: $55.00 to $60.00 /hour", "$60 - $70 an hourContractJob SummaryGreetings!!My name is Kartik Udaykumar and I work with CitiusTech Inc. as a Senior Recruiter.We are a leading IT Healthcare Service provider. Our practice areas include-Health Information Systems, healthcare Software Engineering & Development, health cloud, Big Data, Mobile Health and many other technologies. Currently, CitiusTech’s proprietary platform BI CLINICAL is deployed across 3,800 locations and around 20,000 hospitals across the US.We are also the Integration, Implementation and Healthcare Solution partners with many of the Fortune 500 Healthcare companiesJob Description: Title: Hadoop DeveloperDuration: Full TimeLocation: New York City, NYDesired Skills: Python, SQL, Hive and Shell – Dos, Bash scriptingHadoop concepts -HDFS, fair understanding of Map Reduce – Hortonworks ImplementationKnowledge of ETL conceptsYarn – Resource ManagementJob responsibility: Responsible for Hadoop development and implementation.Loading from disparate data sets and reconciliationPre-processing using Hive , Python and SparkTranslate complex functional and technical requirements into detailed design.Perform analysis of vast data stores and uncover insights.Performance and code optimizationMaintain security and data privacy.Creating algorithms using Spark/Scala leveraging distributed computingHigh-speed querying.Create salable and high-performance API's for data tracking/data queryingWork in a fast-paced, creative atmosphere to develop new ideas that adapt to evolving user needsStrong visual and verbal communication skills.About CitiusTech: CitiusTech is a leading provider of healthcare technology services and solutions to medical technology companies, providers, payers and life sciences organizations. With over 2,700 professionals, we serve over 75 leading healthcare organizations worldwide. CitiusTech offers its clients a wide range of services and solutions including healthcare software development, healthcare interoperability, regulatory compliance, consumer engagement, care coordination and population health management. With extensive capabilities in healthcare technology, CitiusTech has consistently delivered best-in-class solutions at an unmatched cost advantage to its healthcare clients across the world.In 2014, CitiusTech formed an investment partnership with General Atlantic, a leading global growth equity firm. CitiusTech is also closely associated with industry organizations like HIMSS, HL7 and CHIME Foundation.People2,700 employees worldwide700+ HL7 certified professionals1,200+ software product engineering professionalsMarketsMedical Technology: EMRs, Medical imaging, HIS/ RCM and medical devicesProviders: hospitals, IDNs, large medical groups, HIEs and ancillary service providersHealth Plans: payers, ACOs, MCOs and population health servicesLife Sciences: clinical research organizations (CROs) and pharmaceutical companiesClientsACOs, MCOs, HIEs, NHINs and RHIOsHealthcare technology companiesHospitals, IDNs and large medical groupsPayers and Health PlansPharmaceutical and Life Sciences companiesRecognition· 2016: CitiusTech listed in India’s Best Companies to Work for in IT by Great Place to Work Institute, 2016· 2016: CitiusTech named in The 2016 Healthcare Informatics 100 ranking· 2016: HIStalk interviews Dr. Winkenwerder, Director, CitiusTech· 2015: CitiusTech named as 2015 Gold Stevie Award winner· 2015: CitiusTech awarded 2015 Best Companies to Work for Award, for the 4th year in a row· 2015: HIStalk interviews Rizwan Koita, CEO, CitiusTechCitiusTech’s global presence includes the US (Princeton NJ, Seattle WA, Sarasota FL), Europe (London, Germany), Asia (Middle East, Singapore) and India (Mumbai, Airoli, Bangalore).Kartikeyan Udaykumar Talent Acquisition609.772.4012www.citiustech.comJob Type: ContractSalary: $60.00 to $70.00 /hourExperience:Hadoop Developer: 4 years (Preferred)Contract Renewal:LikelyFull Time Opportunity:Yes", "Temporary, ContractPYTHON DEVBackend Python DeveloperWe’re looking for a Backend Developer, or Full-Stack Developer. Produce elegant and reliable code that fulfills feature requirements with minimal oversight. The perfect candidate will have strong Flask microservices, Elasticsearch and RDBMS experience. You will work largely independently on this project, but you will be expected to communicate with the team on a daily basis (we’re nice, so this should be easy). You’ll also be asked to defend your technical decisions to peers and management and demo your work from time to time for your team and the clients (again, all nice and smart people, so should be fine). Looking forward to meeting you!Production Developmentexperience:At least 4 years experience developing enterprise applications in PythonContent Management System -- Django or otherExperience w/Microservices ArchitecturePython Flask REST API + uWSGI + nginx web serverElasticsearch for keyword and tag searchSplunk -- Site metrics and dashboardPerformance tuningCloud Computing (AWS)Amazon SQS for asynchronous processingAmazon S3 for web traffic data * GitHubSQL /Relational DatabasesStripe-python for app-integrated vendor contacts e-commerceProject Experience:Scrum/Agile experience preferredBonus:Languages: JavascriptWeb Dev familiarity: ReactDev Ops & Infrastructure experience / knowledge (can be non-professional)Containerization / DockerUsed and/or contributed to open-source repos.Industry standards to scale servicesJob Types: Temporary, ContractExperience:Content Management System -- Django or other: 4 years (Preferred)Python: 4 years (Preferred)Cloud Computing (AWS): 4 years (Preferred)Python Flask REST API + uWSGI + nginx web server: 4 years (Preferred)Location:New York, NY (Required)Work authorization:United States (Required)Full Time Opportunity:Yes", "$65 - $70 an hourContractPlease let me know if you are interested for below job position with my Direct Client.Senior Python DeveloperNew York DowntownLong Term ContractFace To Face interview MustBanking ClientJob Duties :Responsible for designing, developing, enhancing and/or maintaining applications for investment bank.Enterprise application development using Python. Any knowledge on additional languages such as Java will be a plus, but not required.Design, code, test and document programs.Will involve code refactoring.Interaction with stakeholders and business partners.Skills required :Excellent hands-on development experience on Python with additional understanding on regular expressions is a plus.Experience on participating in end-to-end development life cycle in a rigorous test driven software development environmentExperience in enterprise application development with financial firms is a plus.Excellent communication skillsExperience of Agile methodologies and following code principles is good.Python with NLP techniques is a plus.Any Machine learning capabilities is also plus.I know the hiring manager and if we can get an excellent candidate this will be a very quick move.Reach me alok(at)geeksoftllc(dot)com OR (732)692-8286.Job Type: ContractSalary: $65.00 to $70.00 /hourExperience:NLP: 1 year (Preferred)Machine learning: 1 year (Preferred)Java Developer: 4 years (Preferred)Python: 3 years (Preferred)Agile methodologies: 3 years (Preferred)Location:New York, NY (Preferred)Work authorization:United States (Preferred)Contract Length:7 - 11 monthsContract Renewal:PossibleFull Time Opportunity:No", "ContractW2 positionPython DeveloperNew YorkPhone + In-person (zoom video for ex-Cap One)Job DescriptionYou will be focused on full stack development to help build out key user experiences on our Commercial Bank servicing platform. You will use modern development languages like Python to construct lightweight and scalable microservice APIs to interact with state of the art user interfaces built in Angular 6, all at the 'speed of Cloud'.You will help design and build these great customer-facing experiences while at the same time, interface with multiple downstream systems to help provide a fully-automated solution for our clients. This is a complete build from scratch project so you will need to know architectural designs in detail and have a firm command and capability to guide others in the team thats learning Python and Angular 6.Aside from \"building cool stuff\", you should know industry standards like security, session management, CI/CD practices, and keep up to date on the latest technology trends and development best practices.You will:Work with product owners to understand desired application capabilities and testing scenariosContinuously improve software engineering practicesWork within and across Agile teams to design, develop, test, implement, and support technical solutions across a full-stack of development tools and technologiesLead the craftsmanship, availability, resilience, and scalability of your solutionsWork with Python, REST, microservices, Docker, Kubernetes, AWS/Cloud infrastructureBasic Qualifications:Bachelors Degree or military experienceAt least 7 years experience in software developmentAt least 4 years of extensive experience in PythonPreferred Qualifications:Masters DegreeAt least 2 years of extensive experience in Angular 5/66+ years experience in software development6+ years experience in Agile practicesAdditional Notes to Vendor :Must be localPhone + In-person interview (Zoom video for ex-Cap One)Job Type: ContractExperience:Python: 1 year (Preferred)", "ContractJob Overview: We are looking for a Postgres SQL/Python developer with Financial Services experience and IT project delivery experience\nDuties & Responsibilities:\nOver 4-8 years of experience in Information Technology3+ years working as a database developer working with PostgreSQLMinimum 1 year experience with PostgresqlMinimum 2 year experience with Python programmingStrong in SQL, PL/pgSQL, including stored procedures, functions, triggers, and views.Experience with database development and ETL processesBuild SQL queries implementing functions, packages, views, triggers, and tablesPerform database operations and queries using PgSQL.Proficient in Python programmingDevelopment tools include Git, Jenkins, Bitbucket, PyCharm, Docker ComposeProficient developing complex queries in SQLKnowledge of JSON and PostgreSQL support for JSON.AWS experience is a plusExperience with DST Systems for investor, investment, advisor/intermediary, and asset\ndistribution for direct and intermediary sales of mutual funds, alternative investments,\nsecurities , brokerage accounts, and retirement plans\nSolid understanding of database design principalsSolid understanding of query execution plansGood performance tuning skillsAbility to proactively identify, troubleshoot and resolve live database\nsystems issues.\nProblem-solving skills\nSkill, Experience & General information required:\n\nExperience working in an Agile Development Software environmentTrusted to work independently with stakeholders at all levelsAbility to execute projects and tasks with minimal guidance and supervisionExcellent oral and written communication skillsExcellent data gathering, analytical and problem-solving skillsKnowledge of Data warehousing, Business Intelligence and Data miningExperience in Financial Services industry", "ContractSkills: Expert Python full stack developer with experience using Flask and Oracle DB.Job Description:Required Skill Set:Python development experienceFLASK frameworkConnectivity to various data sources (like Oracle)Extensive use of classes and OOP developmentJob Types: Full-time, Contract", "$36,000 - $45,000 a yearContractLessonbee Inc. is building a future where health and wellness are at the center of classroom instruction, and students have access to the lessons they need for success in school and in life. Our transformative school-based health education platform and adaptive digital curriculum are democratizing health and sex education by making comprehensive, consistent and credible health and sex education possible for every student in the US, regardless of their location.\nWe’re looking for a rock star growth hacker that can join us on a contract-to-hire basis and help us build our traction story over the next few months leading up to our initial fundraise.\nYou’re scrappy and creative. You think of things that other people don’t think of. You can make any business successful because you’re charismatic, confident but humble, and wicked smart, but you’re motivated to join a business that’s working to make the world a better place. You either have connections to school district purchasing decision-maker, teachers, as well as local and national health organizations, or you know how to work your network to quickly find and engage the right people. You’re excited about building something from the ground up, making a name for yourself, and you’re willing to put it the work to reach your career goals.\nAn interest in education technology is highly desirable as well as aptitude and experience in brand-building, sales, content development, content marketing, data and analytics, and search engine optimization.\n\nRequirements\nResponsibilities:\nDevelop social media campaigns and brand building activities using platforms such as Facebook, Twitter, Instagram, etc.\nOwn the creation and delivery of a monthly email to keep potential investors, mentors and advisors up to date our progress and generate interest\nWrite and edit content in both technical and editorial tone that helps to educate others about topics related to Lessonbee such as health and sex education\nRespond to inquiries via phone, email, and other tools to pre-qualify new prospective clients\nPerform data analysis of social media activities and outputs and make strategic recommendations for growth\nCompile reports including those with charts and graphs\nWork on special projects as required\nPossibly manage 1-2 marketing interns\nProvide administrative support as needed\nThe ideal candidate will have:\nExperience growing customers for an EdTech startup\nExperience working at an early stage EdTech company or strong desire to join one", "$15 - $50 an hourContractWe are a Data-science consulting company & boot-camp in New York.Looking for developers with proven record in mentoring, training and motivating new learners new hires.We understand that you might not have all the relevant Exp but this is what is expected in the role.Experience in Python, Pandas, SQL, Scikit Learn, Hadoop.Understanding of Regression, Classification, Decision Tree,Someone who has taught programming to non programmers and aged candidates.Industry experience not needed.Help our learned use Jupyter Notebook using Golab / Azure notebook.Using Cloudera to run PySpark, Spark-SQL, HIVE, Scoop for Cloudera Admin / Cloudera Developer Certification.Other responsibilities:Looking for instructors with proven record in mentoring, training and motivating new learners. Experience in any kind of teaching helpful.Experience with Python, SQL and Hadoop Big Data helpful.Someone who has taught programming to non programmers and aged candidates.Industry experience not needed.Masters student with experience in teaching can apply.Other content by us:http://blockchainainyc.com/https://notebooks.azure.com/shivgan3/projects/PythonClassesNYCBootcamphttps://www.udemy.com/user/shivganjoshi2/Job Type: ContractSalary: $15.00 to $50.00 /hourEducation:Master's (Preferred)Work authorization:United States (Preferred)Contract Renewal:Not likelyFull Time Opportunity:No", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$75 - $100 an hourContract*Candidates on H1B visa, CPT/OPT or on C2C employment - Please do not apply. Third party consulting companies with H1B candidates, please do not apply.*Our Corporate Technology team relies on smart, driven people like you to develop applications and provide tech support for all our clients across USA. You'll be part of a team specifically built to meet and exceed our evolving technology services and solutions, as well as our technology projects all across the USA.We are seeking a Machine Learning Engineer who has worked on cloud platforms with experience in Global Finance industries and healthcare. You will help our Machine Learning Engineering and Services team provide niche solutions for our clients. You will support end-to-end development and implement ML on deployment environment to accelerate our data science teams.This role will require a variety of skills including:3+ years of exceptional hands-on knowledge of robust software design and developmentStrong Java/ Python programming skills and Web Services (spring boot).Experience in Big Data technologies and utilities (Hadoop, Spark SQL, Hive, Impala, Pig, Kafka)Experience in distributed computing and micro servicesExposure to or interest in MLExperience in designing and implementing scalable solutions in the analytics spaceExperience in building reliable and auditable CI/CD deployment pipeline using JenkinsExposure working with Cloud based applicationsExposure working with data and variety of databasesExposure/competence with Agile Development approachAbility to collaborate with high-performing teams and individuals throughout the firm to accomplish common goalsAt Ribus Group - we value the unique skills of every employee, and we're building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global consulting technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.Job Types: Full-time, ContractSalary: $75.00 to $100.00 /hourExperience:Data Science: 5 years (Preferred)Machine Learning: 3 years (Preferred)Cloud Computing: 5 years (Preferred)Python: 5 years (Preferred)Education:Bachelor's (Required)Required travel:75% (Required)Benefits offered:Paid time offParental leaveHealth insuranceDental insuranceHealthcare spending or reimbursement accounts such as HSAs or FSAsChild Care benefitsGym memberships or discountsCommuting/travel assistanceEmployee discountsFlexible schedulesWorkplace perks such as food/coffee and flexible work schedules", "$60 - $65 an hourContractJob SummaryJOB DESCRIPTION Team is looking for people with strong SQL background. Python is secondary in this case.Data Engineer with AWS Cloud experience, Data Warehousing, SQL and Python expertise.Have minimum of 1-3 year of experience in AWS Redshift/ EMR/ PysparkStrong SQL background requiredFamiliar with DWH concepts and have 1+ years of experience in building DWHAt least 1 year of experience in PythonResource with very strong SQL background. Python is secondary in this case.Job Types: Full-time, ContractSalary: $60.00 to $65.00 /hourExperience:AWS: 3 years (Preferred)Contract Length:More than 1 yearContract Renewal:PossibleFull Time Opportunity:Yes", "$150,000 a yearPart-time, Contract\nPlease note that this is a part-time, contract position.\n\nAre you an expert in Python? SQL? Spreadsheets? Data Engineering? Do you want to share your knowledge with over 3 million learners worldwide?\n\nThe days of learning data science by passively consuming video lectures are over. Real learning takes place when a student's hands are on the keyboard, writing code, working with data, and solving problems. If you agree, keep reading!\n\nABOUT DATACAMP\n\nDataCamp is building the future of data science education. Our students get real hands-on experience by completing self-paced, interactive data science courses from the best instructors in the world, right in the browser. In fact, millions of students around the world have completed over 90 million DataCamp exercises to date! All DataCamp content is in English and caters to a global learner population.\n\nBehind every great DataCamp course are the passionate folks who built it. We decided early on that the best way for us to maximize value for our students is to build courses in partnership with top companies and experts in the data science community. That's why our course library is packed with courses from companies like Anaconda and RStudio and data scientists like Andy Müller (scikit-learn), Julia Silge (Stack Overflow), and Hadley Wickham (ggplot2, dplyr)...\n\nAND YOU! Join the ranks of our amazing part-time, contract instructors!\n\nScale your impact to a global audience\n--------------------------------------\n\nShare your knowledge with over 2,770,000 data scientists around the world.\n\nBuild your data science brand\n-----------------------------\n\nAssociate your name with the things you teach and cool stuff you've built.\n\nSupplement or replace your income\n---------------------------------\n\nWhile average monthly earnings per course are in the $1-2K range, our top instructors are making over $150K per year in royalties.\n\nUse data to improve your teaching\n---------------------------------\n\nLearn from data on how thousands of students engage with your content.\n\nApply to become a DataCamp instructor today!\n\nFAQs ( https://www.datacamp.com/create )", "ContractJob SummaryNeed Kdb resource in New York, NYTechnical skillsMust Have - Hands on experience (and preferable if certified in Q/KDB).Understanding on various technologies including C#, Java, Perl, Python, Shell Programming and UnixAgile/Scrum developmentExp Levels – Between 6-10 yrs of exp.Job Type: ContractExperience:KDB: 2 years (Preferred)Contract Length:1 yearContract Renewal:Likely", "ContractPosition: IBM Guardium + PERL consultantsLocation: New York Or Montreal (Might have 1-2 days remote option in a week)Duration: 6+ MonthsRoles and ResponsibilitiesThe Guardium developer role will be responsible for maintaining, developing Guardium scripts. Experience writing/maintaining Perl/Python/Power Shell scripts and very comfortable with using the command line interface (CLI)Looks like they need someone who would be good with Guardium operations. Script maintenance (existing and new scripts). They know some of the existing Perl/Python scripts will break when Guardium is upgraded to 10.5. The person would be responsible for fixing the scripts to work with 10.5Qualifications and Education RequirementsLinux scriptingPerlPythonPower ShellGuardium AdministrationExperience upgrading Guardium to 10.5Preferred skillsThe person needs a strong Guardium background. The consultant would be responsible for writing new/maintain Perl/Python/Power Shell scripts to maintain Guardium environment.PerlPythonPower ShellJob Type: ContractExperience:IBM Guardium + PERL: 1 year (Preferred)", "ContractTruveris is a digital health company that partners with employers, brokers, and pharmaceutical companies to dramatically improve people’s ability to afford and access prescription drugs. With expertise and technology solutions that span across the prescription drug ecosystem, we deliver the outcomes people and businesses need to thrive.\n\nWe are on a mission to transform the pharmaceutical industry and are backed by leading venture capital firms including Canaan Partners, First Round, New Atlantic Ventures, New Leaf Venture Partners, Tribeca Venture Partners and McKesson Ventures. In 2018, Truveris was ranked as one of the fastest growing technology companies in the U.S. by Deloitte, Crain's, and Inc.\n\nThe Associate Analyst works with a fast paced team of business and technical collaborators to coordinate data and information exchange in order to implement and deliver pharmacy benefit analytical services for a portfolio of clients. Duties include service deliverable tracking, file and document management, data validation, and delivery of reporting and analytics. This position requires effective communication, organization, and relationship building skills.\nResponsibilities\nManage delivery deadlines and schedules for a portfolio of clients\nDetermine pharmacy benefit contractual pricing terms and configure them into proprietary claims analysis systems\nFacilitate on-boarding of pharmacy benefit and claims data\nAnalyze system results and resolve data conflicts\nUtilize Excel, Access, SQL, and Looker to manipulate, extract, and analyze data\nGenerate reports and drive high standards through continuous optimization of quality assurance and management practices\nIdentify and manage risk and issues associated with product deliverables\nPresent findings externally to clients and pharmacy benefit consultants as well as internally to Sales, Account Management and Executives\nManage and document workflow using a project management system\nPartner with business and technical collaborators to implement product enhancements through the submission of user requirements to product team\nQualifications\nSelf-starter and driven with a can-do attitude\nExtremely collaborative and team player\nBachelor's degree with relevant major (Finance, Economics, Business Administration, or related field)\nPrescription claims data experience a plus\nSkills\nStrong user knowledge of Microsoft Office, especially Excel\nExperience with Access & Python language a plus\nProfessional and effective verbal and written communications skills\nStrong interpersonal skills and desire to work collaboratively with technical and non-technical staff", "ContractTECHNOLOGY\nNYC\nBlocPower is looking for a Full Stack Developer who is excited to help revolutionize the green energy industry.\nRequired / Desired Skills\nPython ( 3 to 5 years )\nFlask and/or Django framework\nMicro service architectures\nAmazon Web Services\nNice to Have\nExperience working with Jupyter notebooks, Spyder, Pandas, and other science and statistics software packages\nMinor degree/course works/experience in statistics and mathematics, physics or physics engineering\nEducation/Experience\n3-5 years of experience as a full stack developer\nBA/BS or equivalent combination of work experience and education\nContract and full-time positions available. Please send a cover letter and your resume to jobs@blocpower.io.", "$65 - $75 an hourContractThis Senior Database Administrator position is responsible for the design, setup, and implementation of Oracle Unified Directory. The Senior Database Administrator is also responsible for the maintenance of databases, which includes but is not limited to: production support, security and auditing, performance turning, backup and recovery, data replication, DR testing and documentation.Duties and Responsibilities: (list most important and frequently performed first) Written using active, present verbs ie: Perform, Write, Code, etc.Design and implement OUD.  * Provide 24x7 support to production and critical project including participating in a weekly on call rotation.  * Provide database management and support for Oracle Enterprise 12c (CDB/PDB) environments, including setup, configuration, deployment, backup/restore, monitoring, alerting, auditing and security.  * Monitor database server performance, making and implementing tuning recommendations, capacity planning, database security and data integrity including backup/recovery with RMAN and other tools, export/import etc.Support enterprise capacity and performance planning efforts, capacity planning, maintaining and auditing security roles, cloning systems to development environments, patch management.  * Refresh development and test databases with production data as requested  * Enforce user access control based on the company compliance policy. Provide weekly, quarterly and adhoc audit reports to Information Security Officers.  * Ensure proper security of all databases and their respective database management systems within the corporation including maintaining and auditing security roles, auditing security and account management functions.  * Perform periodic database backup restore and DR test exercises.  * Responsible for the development of documentation to perform tasks listed above.Minimum Qualifications: (MUST list minimum level of experience (years) and education required)Bachelor’s Degree in Computer Science or related field or equivalent, relevant experience.  * 7 years of Oracle database administration and 2 years of Oracle Unified Directory experiences.Technical Skills: (list required computer and technical skills and equipment/software used)Comprehensive knowledge of various Oracle Database design techniques, including: Oracle Unified Directory, Oracle OEM, Audit Vault and Database Vault.Experience as an Oracle database administrator supporting production and non production environments  * Experience working in a Linux-based and vm environment with comfortable familiarity with Linux commands and operations  * Good interpersonal skills, with ability to work across functional lines, and at many levels.  * Ability to work on assigned tasks independently and executes with minimal direction.  * Must be able to work on multiple projects simultaneously, meet project deadlines, and work under pressure.  * Experience on CIS Benchmark, Mongo DB, Python scripting are pluses.Job Type: ContractSalary: $65.00 to $75.00 /hourExperience:Oracle DBA: 7 years (Required)Oracle OEM: 3 years (Required)Python: 3 years (Preferred)Oracle Unified Directory: 3 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)", "Part-time, Contract, InternshipPosition Overview\nLegg Mason’s elite Next Gen Analyst program is seeking interns who can bring TOP talent (new technologies, outlooks, and perspectives) to the firm! If you are looking for a rich opportunity to apply your skills and to gain a deeper understanding of the financial industry, than this is the Internship for you!\n\nLegg Mason is seeking a data savvy Intern to join our U.S. Product team for the 2019-2020 school year! As a Product Data Analytics Intern, you will gain exposure to Legg Mason's businesses across various investment products including mutual funds, money market funds, collective trusts, and 529 funds and various functions including the distribution partner business and the fund board governance process.\nKey Responsibilities:\nThe Product Data Analytics Intern will work on projects utilizing data and predictive analytics skillsets to automate processes, enable client targeting and inform the strategic business decision-making process. Key responsibilities include:\nCreate predictive analytics to uncover potential growth opportunities and enhance client targeting.\nLiaise with the Technology team to help facilitate the data collection process\nConstruct competitive analytics tools and management dashboards in Tableau, utilizing industry and proprietary data. Develop insights by analyzing industry trends.\nDevelop a dashboard in Tableau to monitor distribution partner trends. Analyze term arrangements and automate financial impact analyses\nMaintain and enhance an algorithm in Python, used to monitor the Legg Mason mutual fund family.\nMaintain and improve methodology for competitive fee peer group analyses in Business Objects.\nConstruct financial models for business impact analyses.\nAssist the Board team with ad hoc requests for data analysis\nAssist in addressing enhancements to the annual contract renewal project. Automate an extensive data collection process from various system-generated reports.\nAssist in preparing the final reports to the Boards’ contract renewal committees. The reports are comprised of both PowerPoint and Excel files.\nQualifications:\nCurrently pursuing an advanced degree in Data Analytics, Computer Science, Finance or a STEM related field\nProgramming knowledge (Python, R, or SQL) required\nRelevant coursework or internship experience (e.g. artificial intelligence, data analytics, business objects) required\nTableau, Business Objects, or AWS experience a plus\nFinancial modeling experience a plus\nAdept at quantitative analysis and synthesizing data\nProficiency in Excel and PowerPoint\nSelf-starter, Innovative thinker; can take a fresh look at current processes and identify new and creative ways to approach tasks\nDisplays learning agility and intellectual curiosity\nInterest in the Asset Management industry\nCompany Overview\nThis program is designed to provide a rich opportunity for students who are interested in gaining a deeper understanding of the financial services industry and contribute while working on special projects. This Internship will run three consecutive semesters (Summer, Fall, and Spring), full-time during the Summer and part-time during the Fall and Spring semesters, and students will connect with fellow interns, and the Legg Mason community.\n\nIf you are passionate about the investment business and about building your future with one of the industry's premier firms, consider the opportunities at Legg Mason today.", "ContractFramestore is interested in hearing from Freelance VR/AR Programmers to work in our NY Studio on short and long term projects.\n\nWe strive to create unique and high quality VR and AR content. Our focus is to marry beautiful Hollywood caliber visual content with AAA interactive experiences.\n\nResponsibilities\n\nDevelop clean, optimized high and low level code for different platforms\nIdentify technical issues and solve complex problems with innovative solutions\nMaintain code, including troubleshooting, optimization and debugging\nResearch creative solutions to improve efficiency and satisfy technical requirements\n\nRequired Skills\n\nStrong C++ skills\nExperience with game engines, Unreal preferred\nStrong math and physics skills\nFamiliarity with engine build systems and their scripting languages\n\nNice to Have\n\nProficient with Python or C#\nKnowledge shader programming (cg/hlsl/glsl)\nExperience with VR/AR platforms\nFamiliar with the Digital Content Creation tools used for game assets\nExperience with Bash, Windows batch script, and/or JavaScript\n\n", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "ContractFramestore is interested in hearing from Freelance VR/AR Programmers to work in our NY Studio on short and long term projects.\n\nWe strive to create unique and high quality VR and AR content. Our focus is to marry beautiful Hollywood caliber visual content with AAA interactive experiences.\n\nResponsibilities\n\nDevelop clean, optimized high and low level code for different platforms\nIdentify technical issues and solve complex problems with innovative solutions\nMaintain code, including troubleshooting, optimization and debugging\nResearch creative solutions to improve efficiency and satisfy technical requirements\n\nRequired Skills\n\nStrong C++ skills\nExperience with game engines, Unreal preferred\nStrong math and physics skills\nFamiliarity with engine build systems and their scripting languages\n\nNice to Have\n\nProficient with Python or C#\nKnowledge shader programming (cg/hlsl/glsl)\nExperience with VR/AR platforms\nFamiliar with the Digital Content Creation tools used for game assets\nExperience with Bash, Windows batch script, and/or JavaScript\n\n", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$43 - $45 an hourContractDevelopment QA TesterJob Description8 or more years of relevant industry/domain experienceMandatory CPE, Wifi and Cable TV experienceProven work experience in software developmentProven work experience in software quality assuranceStrong knowledge of software QA methodologies, tools and processesExperience in writing clear, concise and comprehensive test plans and test casesHands-on experience with both white box and black box testingHands-on experience with automated testing toolsSolid knowledge of SQL and scriptingExperience working in an Agile/Scrum development processAbility to create detailed, comprehensive and well-structured test plans and test casesAbility to design, develop and execute automation scripts using open source toolsIdentify, record, document thoroughly and track bugsLiaise with internal teams (e.g. developers and product managers) to identify system requirementsMonitor debugging process resultsResponsible for testing all user stories during the course of the sprint development cyclesCreation of automation tests, as applicableLinux - on a proficiency scale of 1-5, three or morePython - on a proficiency scale of 1-5 three or moreWorking experience with HP ALM, Jira is a PlusJob Types: Full-time, ContractSalary: $43.00 to $45.00 /hourExperience:Set top box (cable TV): 2 years (Required)Agile/Scrum: 4 years (Required)Testing: 8 years (Preferred)SQL and scripting: 4 years (Required)Linux and Python: 4 years (Required)SQA: 6 years (Required)Education:Bachelor's (Required)Location:Woodbury, NY (Preferred)Work authorization:United States (Required)", "ContractJob SummaryPosition: C++ DeveloperLocation: NYC,NYDuration: Long Term ContractResponsibilities and DutiesQualificationsFront-office development team is seeking a hands-on C++ developer for our high performance, distributed risk calculation engine in the context of a larger global team responsible for handling Listed and OTC Commodity derivative trading through all aspects of the trade life cycle. The candidate will work closely with other members of the Technology team and Quants locally and globally. Candidate will be responsible for full SDLC including understanding technology requirements, developing, building, testing, and deploying code to production as well as providing 3rd level support by working with the front-line production management team.· 5+ years experience C++· 3+ years Java· STL, Boost· Self-starter, strong analytical, problem solving, and communication skills who can work effectively in a teamSkills desired:· Operating in Linux/Unix environment· Python and shell programming· Experience with SOAP/XML· Relational database skills (SQL, Sybase, DB2)· Understanding of multithreading and distributed programming· Commodities/Finance experience not requiredJob Types: Full-time, ContractExperience:C++: 5 years (Required)JAVA: 3 years (Required)", "$65 - $70 an hourContractPlease let me know if you are interested for below job position with my Direct Client.Senior Python DeveloperNew York DowntownLong Term ContractFace To Face interview MustBanking ClientJob Duties :Responsible for designing, developing, enhancing and/or maintaining applications for investment bank.Enterprise application development using Python. Any knowledge on additional languages such as Java will be a plus, but not required.Design, code, test and document programs.Will involve code refactoring.Interaction with stakeholders and business partners.Skills required :Excellent hands-on development experience on Python with additional understanding on regular expressions is a plus.Experience on participating in end-to-end development life cycle in a rigorous test driven software development environmentExperience in enterprise application development with financial firms is a plus.Excellent communication skillsExperience of Agile methodologies and following code principles is good.Python with NLP techniques is a plus.Any Machine learning capabilities is also plus.I know the hiring manager and if we can get an excellent candidate this will be a very quick move.Reach me alok(at)geeksoftllc(dot)com OR (732)692-8286.Job Type: ContractSalary: $65.00 to $70.00 /hourExperience:NLP: 1 year (Preferred)Machine learning: 1 year (Preferred)Java Developer: 4 years (Preferred)Python: 3 years (Preferred)Agile methodologies: 3 years (Preferred)Location:New York, NY (Preferred)Work authorization:United States (Preferred)Contract Length:7 - 11 monthsContract Renewal:PossibleFull Time Opportunity:No", "ContractHands on Experience with conceptual, logical and physical modeling using modeling toolsExperience querying and loading data into HANA dimensional data models is requiredIn-Depth Knowledge of SAP HANA concepts like indexing, cardinality joins and remodeling.Minimum 6 years of working experience in transactional modeling and dimensional data warehouse model development.Work with other data modelers and ETL developers to design data loads into HANA.Bachelor degree in Computer Science, Math or a related IT field or equivalent work experience in an IT field requiredTableau experience is a big plusExperience with SAP BI and DW is a plus along with strong SQL Scripting knowledge.Cloud models/concepts and SAP Cloud models (SAP Cloud Platform, etc.)Concepts/ technologies like Hadoop, Hive, HBase, MongoDB, MapReduce is a plus.Programming/scripting in Python, R or JavaJob Types: Full-time, Contract", "ContractNeed Desktop Support Analyst with Programming knowledge\n\nNew York, NY\n\n1 year contract\n\nThese will be your tasks:\nDescription and Skills required:\n\nTwo years of experience with the Salesforce platform or three years of relevant experience elsewhere.\nProficient with customer communications and support, and are generally proficient with tools, systems and processes required to accomplish your job.\nCapable of performing basic root cause analysis and identifying preventative measures.\nExperience in various areas of technology.\nRamp up quickly into a solid, productive member of the team.\nKnowledge of commonly used concepts, practices, and procedures of systems administration and support, and can resolve a variety of basic to moderately complex issues.\nYou are able to provide analysis of business processes and related support requirements.\nMeet defined commitments and deadlines.\nMultiple complex incidents for a large case volume and backlog with competing priorities.\nApplying known documented solutions and processes taking work items through to completion in a self directed manner.\n\nIntermediate in the following technical areas – Technical skills required:\n\n\nHardware provisioning, imaging, troubleshooting, and software installation expertise for laptops (Apple & Dell), desktops (Dell), and corporate owned/BYOD mobile devices (IOS/Android) along with standard peripherals.\nUser and administration of operating systems including Mac OSX/IOS, Windows, and Linux Ubuntu.\nTCP/IP networking support and troubleshooting knowledge a corporate user and remote user environment with LAN, WAN, and VPN implementations globally.\nTroubleshooting a variety of client, mobile and cloud applications office software (Microsoft Office, Google Apps, Browsers, Salesforce.com, etc.)\nOperating system and application security models including permissions and user access\nCreation, management, and termination of user accounts in Active Directory. Proficient in scripting with Powershell and access management.\nFile transfer and Web Services Integrations\nA programming language (e.g. PL/SQL, JavaScript, Java, Apex, VisualForce, HTML, Python, Perl, etc)\nChange and use dashboards and reports used to run daily operations and answer ad hoc questions.\n\n-\n\nIntermediate in the following process areas – Required Process Skills:\n\n\nUnderstanding and adhering to security policies and corporate best practices.\nCustomer and technical support processes.\nAccounting and financial processes\nITIL, Software Release Management, and process improvement processes and practices with internal and external partners.\nPartnering with senior members of the team to learn new skills, ask for help, and escalate.\nAptitude and ability to learn to adapt quickly to new technology and business requirements in a fast paced, dynamic global environment\nTraining team members in formal and informal settings.'\n\nYou're offering these qualifications:\nDescription and Skills required:\n\nTwo years of experience with the Salesforce platform or three years of relevant experience elsewhere.\nProficient with customer communications and support, and are generally proficient with tools, systems and processes required to accomplish your job.\nCapable of performing basic root cause analysis and identifying preventative measures.\nExperience in various areas of technology.\nRamp up quickly into a solid, productive member of the team.\nKnowledge of commonly used concepts, practices, and procedures of systems administration and support, and can resolve a variety of basic to moderately complex issues.\nYou are able to provide analysis of business processes and related support requirements.\nMeet defined commitments and deadlines.\nMultiple complex incidents for a large case volume and backlog with competing priorities.\nApplying known documented solutions and processes taking work items through to completion in a self directed manner.\n\nIntermediate in the following technical areas – Technical skills required:\n\n\nHardware provisioning, imaging, troubleshooting, and software installation expertise for laptops (Apple & Dell), desktops (Dell), and corporate owned/BYOD mobile devices (IOS/Android) along with standard peripherals.\nUser and administration of operating systems including Mac OSX/IOS, Windows, and Linux Ubuntu.\nTCP/IP networking support and troubleshooting knowledge a corporate user and remote user environment with LAN, WAN, and VPN implementations globally.\nTroubleshooting a variety of client, mobile and cloud applications office software (Microsoft Office, Google Apps, Browsers, Salesforce.com, etc.)\nOperating system and application security models including permissions and user access\nCreation, management, and termination of user accounts in Active Directory. Proficient in scripting with Powershell and access management.\nFile transfer and Web Services Integrations\nA programming language (e.g. PL/SQL, JavaScript, Java, Apex, VisualForce, HTML, Python, Perl, etc)\nChange and use dashboards and reports used to run daily operations and answer ad hoc questions.\n\n-\n\nIntermediate in the following process areas – Required Process Skills:\n\n\nUnderstanding and adhering to security policies and corporate best practices.\nCustomer and technical support processes.\nAccounting and financial processes\nITIL, Software Release Management, and process improvement processes and practices with internal and external partners.\nPartnering with senior members of the team to learn new skills, ask for help, and escalate.\nAptitude and ability to learn to adapt quickly to new technology and business requirements in a fast paced, dynamic global environment\nTraining team members in formal and informal settings.'\n\n", "ContractTECHNOLOGY\nNYC\nBlocPower is looking for a Full Stack Developer who is excited to help revolutionize the green energy industry.\nRequired / Desired Skills\nPython ( 3 to 5 years )\nFlask and/or Django framework\nMicro service architectures\nAmazon Web Services\nNice to Have\nExperience working with Jupyter notebooks, Spyder, Pandas, and other science and statistics software packages\nMinor degree/course works/experience in statistics and mathematics, physics or physics engineering\nEducation/Experience\n3-5 years of experience as a full stack developer\nBA/BS or equivalent combination of work experience and education\nContract and full-time positions available. Please send a cover letter and your resume to jobs@blocpower.io.", "$160,000 - $225,000 a yearContractThis role will be critical in coordinating activities across multiple teams, maintaining highly organized and accurate documentation, and ensuring high quality output on data management and marketing analytics projects.The Project Manager-Data Analytics must have background experience in data management or analytics, a deep understanding of analytical data and systems as well as excellent organization and leadership skills.The Project Manager-Data Analytics will:Help manage intake to the analytics work stream and the backlog, assist in prioritization exercises, and facilitate discussions for items to be included in a releaseTake stewardship of data management, definitions and data quality in our Data Warehouse and related systemsBe the go-to person for questions on locating data, its definition and qualityPerform data management activities and ensure data validity and integrityFulfil project manager role in Marketing Analytics projects, and collaborate with cross-functional teams across different geographies and time zonesManage schedules and overall project status to ensure requirements and project deliverable dates are clearly communicated, understood and executed uponActively manage project risks to recognize/predict potential problems and proactively identify solutions to mitigateDevelop and maintain effective workflows and processesEnsure our data's meta information is comprehensive and all documentation is up to dateKeep track of any data issues, communicate with relevant teams, and lead issue resolutionManage analytics toolset, such as Tableau Server, including the management of users, groups, report releases, etcMinimum Requirements: BS in Computer Science, Mathematics, Business, Statistics or related technical field3 years related work experienceExcellent oral and written communication skills, client/services focus and the ability to support and enable teamworkExcellent organizational skillsStrong experience working with relational databases and using SQLGood understanding of data analytics; ability to analyze raw data, draw conclusions, and develop actionable recommendationsKnowledge of various tools used for data modeling, data warehousing, databases and data analytics (e.g. R, Python, Hadoop, RDBMS, structured/non-structured data)Experience with a Data Visualization tool such as TableauDemonstrated ability to interact effectively with both technical and non-technical usersExperience in use of project management tools, and Agile projects and methodologiesA great team spiritPreferred Requirements: Advanced SQL and data management skillsDeep understanding of digital, media, & marketing data sources and metricsProject Management CertificationJob Type: ContractSalary: $160,000.00 to $225,000.00 /yearEducation:Bachelor's (Required)Location:New York, NY (Preferred)Work authorization:United States (Required)", "ContractJob SummaryTitle : Data Engineer Location: NYCMode : phone and face to faceVisa : USC/GC/H4 EADThis position is C2HResponsibilities: Design and build data management platformsDesign and build scalable data platforms to securely ingest, process, validate, analyze and publish dataPerform POC (proof of concepts), choose the right tools and technologies to be usedManage large & complex data and analytical projects: data transformation, exploration, performance evaluation & testingMove existing ETL jobs from traditional data warehouse processing to the big data processing platform, ensure that the jobs are designed to scaleManage and support data engineering projectsCollaborate with internal team and portfolio company stakeholders in a broad range of sectors to identify business use cases and develop solutions in driving impact through data and analyticsManage and execute the successful delivery of the data (ETL/ELT) pipelines, analytics platforms and reporting tools to meet business needsPerform analyses of large structured and unstructured data to solve multiple and complex business problems utilizing advanced statistical techniques, and specialized expertise in the organization and/or industryAssess data management platformsAssess the complete landscape of a data refinery (data discovery, data loading, data transformation, data validation and data publish)Business Knowledge/Technical Skills: 2+ years professional work experience as a data engineerExperience in building optimized and scalable data infrastructures using traditional, open sources and cloud computing technologiesExperience in data warehousing, data architecture, data quality processes, data warehousing design and implementation, table structure, fact and dimension tables, logical and physical database design, data modeling, reporting process metadata, and ETL processesExperience in developing analytics strategy, roadmap and delivering major change initiativesAbility to set and manage priorities judiciouslyKnowledge of: data processing platforms like Hadoop, Spark, Hive, Google Cloud Platform (Cloudproc, Cloudflow, BigQuiry, Compute Engine), AWS (EMR, Kinesis, lambda, glue) Azure (HDInsight, data factory); Airflow; coding best practices (git/stash usage); Python, Java and Scala; writing production and modular codeOther: Bachelor's degree requiredMaster’s degree in in Computer Science, Statistics, Economics, Physics, Engineering, Mathematics, or other closely related field is preferredThis position will be based out of New York CityJob Type: ContractContract Length:1 year", "ContractPosition : AWS DeveloperVisa : OpenDuration : 6 months*Experience Requires : 7+ Years*Mode of Interview : Telephonic & In-Person (First round Telephonic and second In-Person Interview)Description: BS in Computer Science or related area.Around 7+ years software development experience.Should have 5+ years of experience of AWS Development / AWS Administration.Must have active current experience with Scala, Java, Python, Oracle, HBase, Hive.Experience in Cloud providers like AWS.Proficiency with agile or lean development practices.Experience with serverless architecture (i.e. AWS Lambda, containers)Strong object-oriented design and analysis skills.Excellent written and verbal communication skills.Should be able to creation of different AWS service like API, RDSinstance and Lambdato build a server less application.Experience maintaining and creating new, as needed, cloud compute instances, storage, & other cloud services required to support development team.Experience with modification of Terraform Scripts.Good Communication.AWS Certification is must.Required Skills: Dynamo DB,Mongo DB,Scala,Lambda,API’s,S3,Amazon CloudSearch,AMI Design,CloudFront,AWS Data Pipeline,Serverless builds,Scripted provisioning - Terraform or Cloud Formation,ECR,EC2,Cloud Migration,Cloud Watch,Cloud Trail,Redshift,SagemakerJob Type: ContractExperience:aws: 4 years (Required)software development: 7 years (Required)Location:New York City, NY (Required)License:AWS (Required)", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "$50 - $80 an hourContractQA Automation (SDET) Location:  New Hyde Park, NY*The Job:*As the Software Test Engineer your responsibilities include conducting thorough product testing and maintain agreed upon quality standards in order to provide the highest quality software products to both external and internal customers. Your passion for software quality allows you to create and modify automated test scripts based on manual test cases, functional requirements or existing functionality of the system.As the QA Engineer you work to understand the business requirements and objectives relative to the desired functionality of products and applications. Evaluate and test new or modified software to determine that software meets user requirements and established quality standards.Technology We Use: Python, React, JavaScript, Test Scripts, Automation (Robot Framework / Selenium, and Quick Test Pro), AWS, Git, and JenkinsYour Role: Work as a member of an Agile SCRUM team delivering high quality software in two week sprintsDevelops efficient and thorough sprint test plans. Conducts sprint testing using exploratory, functional test case, and regression (manual and automated) methodsProficiency in Automated testing.Create complex software test scripts.Develops and reinforces testing methods, procedures for measuring product quality, and determining release readinessCollaborates with scrum team developers to develop new features and resolve issuesContributes to the success of the scrum team through active and collaborative participation in sprint planning, daily scrums and sprint retrospectivesDevelops an in-depth level of knowledge of the scrum team’s supported productsDocument software issues and enhancement requests and assist development with concise and detailed steps for duplication of the defects found while performing manual functional, integration, and regression testsContribute towards team estimation and scheduling processWork efficiently and with a high level of energyWhat We Look For: Bachelor’s degree in Computer Science, Mathematics, or a technical field3 years software testing including the development and maintenance of software test plans3 years experience with Automation tools & frameworks like Robot Frameworks/Selenium/Page Object frameworks.3 years experience with development languages such as Java, REST and PythonUnderstanding of agile QA concepts, practices, processes and toolsA passion for delivering high quality products to clientsExcellent communication and problem solving skillsMust be a self-starter, outstanding team player, and results-oriented with a strong desire to learn and grow technically as a member of a scrum teamSkilled negotiating conflict and differing opinionsJob Type: ContractSalary: $50.00 to $80.00 /hourExperience:Selenium: 1 year (Preferred)AWS: 1 year (Preferred)Software Testing: 1 year (Preferred)Java: 1 year (Preferred)Education:Associate (Preferred)", "Part-time, Contract, InternshipPosition Overview\nLegg Mason’s elite Next Gen Analyst program is seeking interns who can bring TOP talent (new technologies, outlooks, and perspectives) to the firm! If you are looking for a rich opportunity to apply your skills and to gain a deeper understanding of the financial industry, than this is the Internship for you!\n\nLegg Mason is seeking a data savvy Intern to join our U.S. Product team for the 2019-2020 school year! As a Product Data Analytics Intern, you will gain exposure to Legg Mason's businesses across various investment products including mutual funds, money market funds, collective trusts, and 529 funds and various functions including the distribution partner business and the fund board governance process.\nKey Responsibilities:\nThe Product Data Analytics Intern will work on projects utilizing data and predictive analytics skillsets to automate processes, enable client targeting and inform the strategic business decision-making process. Key responsibilities include:\nCreate predictive analytics to uncover potential growth opportunities and enhance client targeting.\nLiaise with the Technology team to help facilitate the data collection process\nConstruct competitive analytics tools and management dashboards in Tableau, utilizing industry and proprietary data. Develop insights by analyzing industry trends.\nDevelop a dashboard in Tableau to monitor distribution partner trends. Analyze term arrangements and automate financial impact analyses\nMaintain and enhance an algorithm in Python, used to monitor the Legg Mason mutual fund family.\nMaintain and improve methodology for competitive fee peer group analyses in Business Objects.\nConstruct financial models for business impact analyses.\nAssist the Board team with ad hoc requests for data analysis\nAssist in addressing enhancements to the annual contract renewal project. Automate an extensive data collection process from various system-generated reports.\nAssist in preparing the final reports to the Boards’ contract renewal committees. The reports are comprised of both PowerPoint and Excel files.\nQualifications:\nCurrently pursuing an advanced degree in Data Analytics, Computer Science, Finance or a STEM related field\nProgramming knowledge (Python, R, or SQL) required\nRelevant coursework or internship experience (e.g. artificial intelligence, data analytics, business objects) required\nTableau, Business Objects, or AWS experience a plus\nFinancial modeling experience a plus\nAdept at quantitative analysis and synthesizing data\nProficiency in Excel and PowerPoint\nSelf-starter, Innovative thinker; can take a fresh look at current processes and identify new and creative ways to approach tasks\nDisplays learning agility and intellectual curiosity\nInterest in the Asset Management industry\nCompany Overview\nThis program is designed to provide a rich opportunity for students who are interested in gaining a deeper understanding of the financial services industry and contribute while working on special projects. This Internship will run three consecutive semesters (Summer, Fall, and Spring), full-time during the Summer and part-time during the Fall and Spring semesters, and students will connect with fellow interns, and the Legg Mason community.\n\nIf you are passionate about the investment business and about building your future with one of the industry's premier firms, consider the opportunities at Legg Mason today.", "$60 - $70 an hourContractJob SummaryGreetings!!My name is Kartik Udaykumar and I work with CitiusTech Inc. as a Senior Recruiter.We are a leading IT Healthcare Service provider. Our practice areas include-Health Information Systems, healthcare Software Engineering & Development, health cloud, Big Data, Mobile Health and many other technologies. Currently, CitiusTech’s proprietary platform BI CLINICAL is deployed across 3,800 locations and around 20,000 hospitals across the US.We are also the Integration, Implementation and Healthcare Solution partners with many of the Fortune 500 Healthcare companiesJob Description: Title: Hadoop DeveloperDuration: Full TimeLocation: New York City, NYDesired Skills: Python, SQL, Hive and Shell – Dos, Bash scriptingHadoop concepts -HDFS, fair understanding of Map Reduce – Hortonworks ImplementationKnowledge of ETL conceptsYarn – Resource ManagementJob responsibility: Responsible for Hadoop development and implementation.Loading from disparate data sets and reconciliationPre-processing using Hive , Python and SparkTranslate complex functional and technical requirements into detailed design.Perform analysis of vast data stores and uncover insights.Performance and code optimizationMaintain security and data privacy.Creating algorithms using Spark/Scala leveraging distributed computingHigh-speed querying.Create salable and high-performance API's for data tracking/data queryingWork in a fast-paced, creative atmosphere to develop new ideas that adapt to evolving user needsStrong visual and verbal communication skills.About CitiusTech: CitiusTech is a leading provider of healthcare technology services and solutions to medical technology companies, providers, payers and life sciences organizations. With over 2,700 professionals, we serve over 75 leading healthcare organizations worldwide. CitiusTech offers its clients a wide range of services and solutions including healthcare software development, healthcare interoperability, regulatory compliance, consumer engagement, care coordination and population health management. With extensive capabilities in healthcare technology, CitiusTech has consistently delivered best-in-class solutions at an unmatched cost advantage to its healthcare clients across the world.In 2014, CitiusTech formed an investment partnership with General Atlantic, a leading global growth equity firm. CitiusTech is also closely associated with industry organizations like HIMSS, HL7 and CHIME Foundation.People2,700 employees worldwide700+ HL7 certified professionals1,200+ software product engineering professionalsMarketsMedical Technology: EMRs, Medical imaging, HIS/ RCM and medical devicesProviders: hospitals, IDNs, large medical groups, HIEs and ancillary service providersHealth Plans: payers, ACOs, MCOs and population health servicesLife Sciences: clinical research organizations (CROs) and pharmaceutical companiesClientsACOs, MCOs, HIEs, NHINs and RHIOsHealthcare technology companiesHospitals, IDNs and large medical groupsPayers and Health PlansPharmaceutical and Life Sciences companiesRecognition· 2016: CitiusTech listed in India’s Best Companies to Work for in IT by Great Place to Work Institute, 2016· 2016: CitiusTech named in The 2016 Healthcare Informatics 100 ranking· 2016: HIStalk interviews Dr. Winkenwerder, Director, CitiusTech· 2015: CitiusTech named as 2015 Gold Stevie Award winner· 2015: CitiusTech awarded 2015 Best Companies to Work for Award, for the 4th year in a row· 2015: HIStalk interviews Rizwan Koita, CEO, CitiusTechCitiusTech’s global presence includes the US (Princeton NJ, Seattle WA, Sarasota FL), Europe (London, Germany), Asia (Middle East, Singapore) and India (Mumbai, Airoli, Bangalore).Kartikeyan Udaykumar Talent Acquisition609.772.4012www.citiustech.comJob Type: ContractSalary: $60.00 to $70.00 /hourExperience:Hadoop Developer: 4 years (Preferred)Contract Renewal:LikelyFull Time Opportunity:Yes", "ContractJob SummaryTitle: Sr. VMWare Automation Engineer Work Location: New York City, NY, USAPeriod: 3 to 6 months and may extendClient-Accepted Visa Types: EAD, GC, USC,Rate: -hr on W2Responsibilities and DutiesJob Description: Participate in architectural and engineering discussions to understand business and technical objectives, following project requirements, to develop effective automation solutionsLeverage VMware vRA’s ecosystem via the ServiceNow PortalStrong familiarity with scripting (Unix Shell / PowerCLI / PowerShell / PERL / Python)Strong knowledge of virtualization technologies, specifically VMWare vSphere, ServiceNow portal with VMware vSphere and vRealize Operations ManagerInstall, configure and manage a highly available and scalable virtual infrastructure using automation techniquesProvide planning, installing, configuring, and upgrading support for vRealize Automation & vRealize OrchestratorEstablish and maintaining service levels; perform basic troubleshooting; monitor vRealize Automation & vRealize OrchestratorManage the health of the vRealize IaaS environment and perform upgrades and maintenance as outlined by the service contractStrong scripting skillsPower CLI or PowerShell ScriptingDevelop and troubleshoot Power CLI or PowerShell scriptsQualifications / Required Skill: 3-5 years’ experience developing content for vRealize Automation, ServiceNow Portal & developing PowerShell scripts for VMware Virtualized Infrastructure platform.Provide planning, installing, configuring, and upgrading support for vRealize Automation & vRealize OrchestratorEstablish and maintaining service levels; perform basic troubleshooting; monitor vRealize Automation & vRealize Orchestrator.Possess excellent written and communication skills - Great attitude and teamwork.Ability to work independently and within a teamDesirable: Working with EPIC implementation team in a Healthcare provider environmentMust-Have Primary Skill: 5+ years of expert level experience as a Technical Architect-Technical Architecture-Virtualization-VMware, Hyper V, Xen ServerJob Type: ContractExperience:Scripting: 5 years (Preferred)powershell: 5 years (Preferred)Shell Scripting: 4 years (Preferred)Archival Standards: 5 years (Preferred)IaaS: 4 years (Preferred)Epic: 4 years (Preferred)Education:High school or equivalent (Preferred)Location:New York, NY (Preferred)Work authorization:United States (Preferred)Contract Renewal:Possible", "$65 - $75 an hourContractThis Senior Database Administrator position is responsible for the design, setup, and implementation of Oracle Unified Directory. The Senior Database Administrator is also responsible for the maintenance of databases, which includes but is not limited to: production support, security and auditing, performance turning, backup and recovery, data replication, DR testing and documentation.Duties and Responsibilities: (list most important and frequently performed first) Written using active, present verbs ie: Perform, Write, Code, etc.Design and implement OUD.  * Provide 24x7 support to production and critical project including participating in a weekly on call rotation.  * Provide database management and support for Oracle Enterprise 12c (CDB/PDB) environments, including setup, configuration, deployment, backup/restore, monitoring, alerting, auditing and security.  * Monitor database server performance, making and implementing tuning recommendations, capacity planning, database security and data integrity including backup/recovery with RMAN and other tools, export/import etc.Support enterprise capacity and performance planning efforts, capacity planning, maintaining and auditing security roles, cloning systems to development environments, patch management.  * Refresh development and test databases with production data as requested  * Enforce user access control based on the company compliance policy. Provide weekly, quarterly and adhoc audit reports to Information Security Officers.  * Ensure proper security of all databases and their respective database management systems within the corporation including maintaining and auditing security roles, auditing security and account management functions.  * Perform periodic database backup restore and DR test exercises.  * Responsible for the development of documentation to perform tasks listed above.Minimum Qualifications: (MUST list minimum level of experience (years) and education required)Bachelor’s Degree in Computer Science or related field or equivalent, relevant experience.  * 7 years of Oracle database administration and 2 years of Oracle Unified Directory experiences.Technical Skills: (list required computer and technical skills and equipment/software used)Comprehensive knowledge of various Oracle Database design techniques, including: Oracle Unified Directory, Oracle OEM, Audit Vault and Database Vault.Experience as an Oracle database administrator supporting production and non production environments  * Experience working in a Linux-based and vm environment with comfortable familiarity with Linux commands and operations  * Good interpersonal skills, with ability to work across functional lines, and at many levels.  * Ability to work on assigned tasks independently and executes with minimal direction.  * Must be able to work on multiple projects simultaneously, meet project deadlines, and work under pressure.  * Experience on CIS Benchmark, Mongo DB, Python scripting are pluses.Job Type: ContractSalary: $65.00 to $75.00 /hourExperience:Oracle DBA: 7 years (Required)Oracle OEM: 3 years (Required)Python: 3 years (Preferred)Oracle Unified Directory: 3 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)", "ContractThe role is largely operational and supports product and pricing analytics activities in Product and Analytics team.\nWork with segment managers to deep dive on biz performance; deliver presentations/ assessments of these areas.\nCreate and maintain various tools and models in order to report and facilitate decision making on biz performance.\nPrepares and presents executive decks, project updates, and ad-hoc analysis Partner with regional counterpart in all aspects of pricing/costing and profitability\nCreate automated processes for delivery of any regular reporting work.\nProvide Adhoc analysis and any data pulls required to support the segment.\nOwn customer interface (communication, delivery, quality, value proposition, escalations); Takes ownership for quality of work deliverables and process adherence with guidance.\nLearns and applies basic knowledge in given functional area\n\nTechnical Skill Set\nIs an expert in Data access and analysis, has developed analytical models and solutions, and is exposed to analytical tools like Excel, SQL, Teradata, Tableau, SAS, Statistica, R, Python etc.", "ContractTruveris is a digital health company that partners with employers, brokers, and pharmaceutical companies to dramatically improve people’s ability to afford and access prescription drugs. With expertise and technology solutions that span across the prescription drug ecosystem, we deliver the outcomes people and businesses need to thrive.\n\nWe are on a mission to transform the pharmaceutical industry and are backed by leading venture capital firms including Canaan Partners, First Round, New Atlantic Ventures, New Leaf Venture Partners, Tribeca Venture Partners and McKesson Ventures. In 2018, Truveris was ranked as one of the fastest growing technology companies in the U.S. by Deloitte, Crain's, and Inc.\n\nThe Associate Analyst works with a fast paced team of business and technical collaborators to coordinate data and information exchange in order to implement and deliver pharmacy benefit analytical services for a portfolio of clients. Duties include service deliverable tracking, file and document management, data validation, and delivery of reporting and analytics. This position requires effective communication, organization, and relationship building skills.\nResponsibilities\nManage delivery deadlines and schedules for a portfolio of clients\nDetermine pharmacy benefit contractual pricing terms and configure them into proprietary claims analysis systems\nFacilitate on-boarding of pharmacy benefit and claims data\nAnalyze system results and resolve data conflicts\nUtilize Excel, Access, SQL, and Looker to manipulate, extract, and analyze data\nGenerate reports and drive high standards through continuous optimization of quality assurance and management practices\nIdentify and manage risk and issues associated with product deliverables\nPresent findings externally to clients and pharmacy benefit consultants as well as internally to Sales, Account Management and Executives\nManage and document workflow using a project management system\nPartner with business and technical collaborators to implement product enhancements through the submission of user requirements to product team\nQualifications\nSelf-starter and driven with a can-do attitude\nExtremely collaborative and team player\nBachelor's degree with relevant major (Finance, Economics, Business Administration, or related field)\nPrescription claims data experience a plus\nSkills\nStrong user knowledge of Microsoft Office, especially Excel\nExperience with Access & Python language a plus\nProfessional and effective verbal and written communications skills\nStrong interpersonal skills and desire to work collaboratively with technical and non-technical staff", "ContractLooking for a C++ Software Developer with excellent computer science and programming fundamentals, strong problem-solving skills and the passion and drive to see new initiatives through to completion. In this role, you will be responsible for design, implementation, testing and support of systems, including but not limited to a user interface, back end databases and transport infrastructure. The work will require working closely with the rest of the team and collaboration with other groups within the firm in order to gather requirements, provide training and support.\nREQUIREMENTS\nSeeking a technically capable, entrepreneurial, creative, motivated software developer. Team player and good communicator. Understanding of the full software development life cycle. Solid 3+ years C++ development experience with emphasis on performance and efficiency. Excellent problem-solving skills. Experience developing software in Unix/Linux environment. True passion for software development. Knowledge of at least one shell scripting language, such as Perl or Python. Understanding of STL, Design Patterns and Object-Oriented design.\nSend us your resume to career@pencom.com. Accepted formats are HTML, Microsoft Word, or Plain Text. Your information will be kept strictly confidential. We will not submit your resume to our clients without your prior consent.", "ContractWe are an Agile software development consultancy in NYC. We embed seasoned Agile teams (mainly developers and product managers) with fast growing NYC-based tech teams.\n\nEverything we do is grounded in five values: Humility, Honesty, Respect, Learning from failure, and Willingness to help others. Our values weave a common thread through all we do - from hiring employees to selecting clients. We believe that happiness is the highest level of success and we want every person that crosses paths with Stride to achieve it.\n\nStride is 100% self-funded and is profitable, meaning we don't answer to investors.\n\nWhat you'll be doing:\n\nYou will embed with tech teams in some of Manhattan's most exciting startup and mid-market companies to help them up their game while getting stuff done.\nYou'll be an advocate for non-dogmatic Agile software development\nYou'll mentor teams on the value of software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement\nYou will be the reason your client teams are higher performing on your last day with them than they were on your first day.\n\nYou're a fit for Stride if you have:\n\n5 years of software development experience in a professional environment.\nProficient in multiple programming languages and able to quickly gain proficiency in unfamiliar languages. We do most of our work in Ruby, Python, Vue.js, React.js, Angular.js, and Java.\nCan guide team strategy\nCan see projects through, from inception to deployment\nExperience teaching TDD, story estimation, test writing, and effective pair programming\n\nWhat you can expect from us:\n\nAwesome Culture - We have a 4.8 star rating on Glassdoor and have been one of Crain's best places to work 3 years in a row!\nCompetitive Pay and Benefits\nYou'll work at a self-defined Sustainable Pace\n\n", "ContractMulesoft Developer with Cloud Experience - Urgent Requirement Location: NYDescription:Need Sr. Mulesoft Developer with 5+ years of Experience .Anypoint Platform, API Manager, Cloudhub experienceMUnit skills/other testing tool experienceStrong knowledge of AWS – cloud technologyUnderstanding of networking fundamentalsMulesoft – create mulesoft apis on the mulesoft enterprise service busUnderstanding of Soap and Rest integration developmentGeneral Programing Background (understanding of algorithms and data structures)Languages could include, java, python, C,  * SQL and other query languagesExperience with code source control such as GitExperience with CI/CD tools such as Maven, JenkinsExperience:Aws: 3 years (Preferred)Mule: 3 years (Required)Job Type: ContractExperience:AWS: 1 year (Preferred)mulesoft: 3 years (Preferred)", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "ContractGovernance operationalization using Collibra DGC including architecture, design and integration with other tools.\nImplementation of Collibra DGC , Workflows and related components\nCreate and configure Collibra DGC meta-model, Assets, relationships, domains and communities\nConfigure Collibra Data Governance Center DGC based on client requirements and specifications\nDevelop Collibra dashboard and reporting requirements\nMinimum requirements\n1+ years expérience in Integrations with Collibra, Workflows, Groovy scripts\nExperience implementing Collibra –Collibra connect, MuleSoft, Integration etc\n1+ years delivering web based applications (Java/J2EE,Spring etc.)\n3+ years working as a database developer working with Python, Pycharm, ETL, and PostgreSQL\nMinimum 3 year experience with Postgresql\nMinimum 3 year experience with Python programming\nStrong in SQL, PL/pgSQL, including stored procedures, functions, triggers, and views.\nExperience with database development and ETL processes\nBuild SQL queries implementing functions, packages, views, triggers, and tables\nPerform database operations and queries using PgSQL\nProficient in Python programming with data operations\nDevelopment tools include Git, Jenkins, Bitbucket, PyCharm, Docker Compose\nProficient developing complex queries in SQL\nKnowledge of JSON and PostgreSQL support for JSON.\nAWS experience is a plus", "ContractResponsibilities: Problem solving in a highly virtualized environmentGreenplum Database Installation and Support in cloud environments.Participate in DevOps activities which include job automation and process enhancementsInterface will internal systems owners and participate in agile stands and scrums as needed.Write bash shell and python scripts to support DBA tasks.Database support conducted in AWS, Azure and GCP cloud environmentsMinimum Qualifications: Candidate should have high functioning knowledge of Linux5 years of recent hands on DevOps/Support with Greenplum database3-5 years of recent hands on DevOps/Support experienced with AWS/Azure/Google.Preferred QualificationsCandidate should have high functioning knowledge of Linux7 years of recent hands on DevOps/Support with Greenplum database5-7 years of recent hands on DevOps/Support experienced with AWS/Azure/Google.Job Types: Full-time, ContractContract Length:More than 1 yearContract Renewal:Likely", "$60 - $70 an hourContractJob Title: Big Data(Data Science) Developer Location: New York, NYDuration: 12+ MonthsJob Responsibilities: 8+ years of hands-on programming experience with 4+ years in Hadoop platformProficiency in data analysis and strong SQL skills.Knowledge of various components of Hadoop ecosystem and experience in applying them to practical problems – Hive/Impala/Spark-Scala/MR.Proficiency with shell scripting & PythonExperience in data warehousing, ETL tools , MPP database systemsExperience working in HIVE & Impala & creating custom UDFs and custom input/output formats /serdesAbility to acquire, compute, store and process various types of datasets in Hadoop platformUnderstanding of various Visualization platforms (Tableau)Experience with Scala.Excellent written and verbal communication skillsJob Type: ContractSalary: $60.00 to $70.00 /hourExperience:Shell Scripting: 4 years (Required)Hadoop: 4 years (Required)Java: 6 years (Required)Scala: 1 year (Required)Data Analysis: 1 year (Preferred)Contract Length:More than 1 yearContract Renewal:LikelyFull Time Opportunity:No", "$65 - $75 an hourContractThis Senior Database Administrator position is responsible for the design, setup, and implementation of Oracle Unified Directory. The Senior Database Administrator is also responsible for the maintenance of databases, which includes but is not limited to: production support, security and auditing, performance turning, backup and recovery, data replication, DR testing and documentation.Duties and Responsibilities: (list most important and frequently performed first) Written using active, present verbs ie: Perform, Write, Code, etc.Design and implement OUD.  * Provide 24x7 support to production and critical project including participating in a weekly on call rotation.  * Provide database management and support for Oracle Enterprise 12c (CDB/PDB) environments, including setup, configuration, deployment, backup/restore, monitoring, alerting, auditing and security.  * Monitor database server performance, making and implementing tuning recommendations, capacity planning, database security and data integrity including backup/recovery with RMAN and other tools, export/import etc.Support enterprise capacity and performance planning efforts, capacity planning, maintaining and auditing security roles, cloning systems to development environments, patch management.  * Refresh development and test databases with production data as requested  * Enforce user access control based on the company compliance policy. Provide weekly, quarterly and adhoc audit reports to Information Security Officers.  * Ensure proper security of all databases and their respective database management systems within the corporation including maintaining and auditing security roles, auditing security and account management functions.  * Perform periodic database backup restore and DR test exercises.  * Responsible for the development of documentation to perform tasks listed above.Minimum Qualifications: (MUST list minimum level of experience (years) and education required)Bachelor’s Degree in Computer Science or related field or equivalent, relevant experience.  * 7 years of Oracle database administration and 2 years of Oracle Unified Directory experiences.Technical Skills: (list required computer and technical skills and equipment/software used)Comprehensive knowledge of various Oracle Database design techniques, including: Oracle Unified Directory, Oracle OEM, Audit Vault and Database Vault.Experience as an Oracle database administrator supporting production and non production environments  * Experience working in a Linux-based and vm environment with comfortable familiarity with Linux commands and operations  * Good interpersonal skills, with ability to work across functional lines, and at many levels.  * Ability to work on assigned tasks independently and executes with minimal direction.  * Must be able to work on multiple projects simultaneously, meet project deadlines, and work under pressure.  * Experience on CIS Benchmark, Mongo DB, Python scripting are pluses.Job Type: ContractSalary: $65.00 to $75.00 /hourExperience:Oracle DBA: 7 years (Required)Oracle OEM: 3 years (Required)Python: 3 years (Preferred)Oracle Unified Directory: 3 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)", "ContractDescription: Systems Support.Help to shift the team into an increasingly agile operating model.Accelerate the transformation program.Join the technology team within the TPO.Responsibilities: Administer and support Atlassian services (primarily JIRA, but Confluence, and Bit bucket as well) for primarily internal users.Identify new technologies and opportunities based on industry advances in agile development and strategic planning.On-board new users to the platform, creating training as necessary to facilitate enablement.Partner with business and technology teams to implement Atlassian-based solutions to meet their goals, developing tailored solutions as necessary including custom plugins and workflows.Ensure the confidentiality, integrity, and availability of Atlassian services, managing the deployment, security, and permission models.Continuously update and improve the service based on industry best practices.Requirements: 8-10+ years of experience.Bachelor’s degree in computer science or related field, or equivalent professional experience.Experience managing the Atlassian stack to achieve high availability and security requirements.Able to navigate technical architecture and design topics, particularly integration of Atlassian and related technologies within a complex enterprise architecture.Experience configuring JIRA schemas, complex workflows, and role-based access control.Experience automating workflows using one or more of the following development languages: Python, JavaScript, Perl, Java, SQL.Able to comfortably manage more simultaneous threads than most.Interest in adapting new technologies to continuously improve processes & tools.Strong attention to detail.Must be able to dive into granular detail and still step back to view the broad picture.Comfort with ambiguity.Ability to find the correct path given limited guidance.Strong communication & presentation skills.Desired Skills: 3-5 years as a systems engineer within a high integrity, and/or regulated environment (government, healthcare, financial sectors).Experience leading software development, systems, or infrastructure engineering teams.Demonstrated innovation, creativity and an entrepreneurial mind-set.M11270Job Types: Full-time, ContractExperience:supporting Atlassian services: 5 years (Required)Banking: 6 years (Preferred)Education:Bachelor's (Required)Location:New York, NY (Required)Work authorization:United States (Required)Contract Length:5 - 6 months", "ContractSoHo Dragon represents a Financial Services firm located in Midtown Manhattan. Our client needs to hire an experience Internal IT Auditor. This is project is estimated to last 6 months. Client requires an IT Governance liaison to help with IA, External Audit, Reporting, evidence gathering, walk-through coordination, etc.\n\n\nClear English verbal and written communication ability a MUST.\nLooking to hire a 1099 or on Corp to Corp\nInterview process is phone interview and then face to face\nRequired Certifications include:\nLean Six Sigma\nRisk Control + IT expertise\nRisk Mgmt / IT Audit background\n\nJob Duties:\nAssistance in evaluating the design and operating effectiveness of technology controls, including, but not limited to Software Development Lifecycle (SDLC), Logical Security, Data interfaces, availability / redundancy, and Cyber / Info security.\nPreparing supporting evidence which clearly describes the audit procedures performed, results of testing and conclusions reached for various processes.\nDesigning technology diagrams detailing the systems and their dependencies during the audit process\nAssisting with the Department’s data analytics efforts and Internal Audit report preparation.\nAssisting in the development and tracking of control recommendations for corrective action / improvement. Skills & Experience Required\nFour (4) to seven (7) years of experience working as an IT auditor or in an IT role in a complex highly regulated financial services firm.\nAbility to perform risk-based audits and execute an Information Technology General Controls (‘ITGC’) audit program is required.\n• Knowledge of information technology security and control frameworks (NIST, ISO 27001/2, COBIT5) • Understanding of technology platforms e.g., Microsoft TFS, JIRA, ServiceNow, Active Directory and technology languages (e.g., SQL, Java, Python) is strongly preferred.\nStrong communication skills (verbal and written) and attention to detail is required.\nUnderstanding of the Microsoft Office suite (e.g., Excel, PowerPoint, Visio) is required.", "ContractNeed Desktop Support Analyst with Programming knowledge\n\nNew York, NY\n\n1 year contract\n\nThese will be your tasks:\nDescription and Skills required:\n\nTwo years of experience with the Salesforce platform or three years of relevant experience elsewhere.\nProficient with customer communications and support, and are generally proficient with tools, systems and processes required to accomplish your job.\nCapable of performing basic root cause analysis and identifying preventative measures.\nExperience in various areas of technology.\nRamp up quickly into a solid, productive member of the team.\nKnowledge of commonly used concepts, practices, and procedures of systems administration and support, and can resolve a variety of basic to moderately complex issues.\nYou are able to provide analysis of business processes and related support requirements.\nMeet defined commitments and deadlines.\nMultiple complex incidents for a large case volume and backlog with competing priorities.\nApplying known documented solutions and processes taking work items through to completion in a self directed manner.\n\nIntermediate in the following technical areas – Technical skills required:\n\n\nHardware provisioning, imaging, troubleshooting, and software installation expertise for laptops (Apple & Dell), desktops (Dell), and corporate owned/BYOD mobile devices (IOS/Android) along with standard peripherals.\nUser and administration of operating systems including Mac OSX/IOS, Windows, and Linux Ubuntu.\nTCP/IP networking support and troubleshooting knowledge a corporate user and remote user environment with LAN, WAN, and VPN implementations globally.\nTroubleshooting a variety of client, mobile and cloud applications office software (Microsoft Office, Google Apps, Browsers, Salesforce.com, etc.)\nOperating system and application security models including permissions and user access\nCreation, management, and termination of user accounts in Active Directory. Proficient in scripting with Powershell and access management.\nFile transfer and Web Services Integrations\nA programming language (e.g. PL/SQL, JavaScript, Java, Apex, VisualForce, HTML, Python, Perl, etc)\nChange and use dashboards and reports used to run daily operations and answer ad hoc questions.\n\n-\n\nIntermediate in the following process areas – Required Process Skills:\n\n\nUnderstanding and adhering to security policies and corporate best practices.\nCustomer and technical support processes.\nAccounting and financial processes\nITIL, Software Release Management, and process improvement processes and practices with internal and external partners.\nPartnering with senior members of the team to learn new skills, ask for help, and escalate.\nAptitude and ability to learn to adapt quickly to new technology and business requirements in a fast paced, dynamic global environment\nTraining team members in formal and informal settings.'\n\nYou're offering these qualifications:\nDescription and Skills required:\n\nTwo years of experience with the Salesforce platform or three years of relevant experience elsewhere.\nProficient with customer communications and support, and are generally proficient with tools, systems and processes required to accomplish your job.\nCapable of performing basic root cause analysis and identifying preventative measures.\nExperience in various areas of technology.\nRamp up quickly into a solid, productive member of the team.\nKnowledge of commonly used concepts, practices, and procedures of systems administration and support, and can resolve a variety of basic to moderately complex issues.\nYou are able to provide analysis of business processes and related support requirements.\nMeet defined commitments and deadlines.\nMultiple complex incidents for a large case volume and backlog with competing priorities.\nApplying known documented solutions and processes taking work items through to completion in a self directed manner.\n\nIntermediate in the following technical areas – Technical skills required:\n\n\nHardware provisioning, imaging, troubleshooting, and software installation expertise for laptops (Apple & Dell), desktops (Dell), and corporate owned/BYOD mobile devices (IOS/Android) along with standard peripherals.\nUser and administration of operating systems including Mac OSX/IOS, Windows, and Linux Ubuntu.\nTCP/IP networking support and troubleshooting knowledge a corporate user and remote user environment with LAN, WAN, and VPN implementations globally.\nTroubleshooting a variety of client, mobile and cloud applications office software (Microsoft Office, Google Apps, Browsers, Salesforce.com, etc.)\nOperating system and application security models including permissions and user access\nCreation, management, and termination of user accounts in Active Directory. Proficient in scripting with Powershell and access management.\nFile transfer and Web Services Integrations\nA programming language (e.g. PL/SQL, JavaScript, Java, Apex, VisualForce, HTML, Python, Perl, etc)\nChange and use dashboards and reports used to run daily operations and answer ad hoc questions.\n\n-\n\nIntermediate in the following process areas – Required Process Skills:\n\n\nUnderstanding and adhering to security policies and corporate best practices.\nCustomer and technical support processes.\nAccounting and financial processes\nITIL, Software Release Management, and process improvement processes and practices with internal and external partners.\nPartnering with senior members of the team to learn new skills, ask for help, and escalate.\nAptitude and ability to learn to adapt quickly to new technology and business requirements in a fast paced, dynamic global environment\nTraining team members in formal and informal settings.'\n\n", "ContractJob SummaryPosition: C++ DeveloperLocation: NYC,NYDuration: Long Term ContractResponsibilities and DutiesQualificationsFront-office development team is seeking a hands-on C++ developer for our high performance, distributed risk calculation engine in the context of a larger global team responsible for handling Listed and OTC Commodity derivative trading through all aspects of the trade life cycle. The candidate will work closely with other members of the Technology team and Quants locally and globally. Candidate will be responsible for full SDLC including understanding technology requirements, developing, building, testing, and deploying code to production as well as providing 3rd level support by working with the front-line production management team.· 5+ years experience C++· 3+ years Java· STL, Boost· Self-starter, strong analytical, problem solving, and communication skills who can work effectively in a teamSkills desired:· Operating in Linux/Unix environment· Python and shell programming· Experience with SOAP/XML· Relational database skills (SQL, Sybase, DB2)· Understanding of multithreading and distributed programming· Commodities/Finance experience not requiredJob Types: Full-time, ContractExperience:C++: 5 years (Required)JAVA: 3 years (Required)", "ContractCome join us and grow your career with CTG! Are you interested in working with a well-known company? Apply with CTG for this exciting opportunity!This role is located in Corning, NY- NO Corp2CorpDescription: The position will be responsible for implementing and supporting Quality Management solutions for various division quality and manufacturing locations. The role will also include implementing best practices regarding solution design, development, implementation, and support of such systems like EtQ Reliance. In addition, the role will be responsible for generating critical business metrics, understanding database infrastructures, and interacting with associated supply chain and planning systems. The position requires good communications with IT and Quality professionals who specialize in enterprise Quality Manufacturing Systems.Responsibilities: Configure and Support Quality Management Systems such as EtQ RelianceInteract with customer to gather, define, develop, and support manufacturing applications and solutionsMaintain internal customer communication, assuring timely status updates and issue resolutionMaintain status of SME on specific area of knowledge by researching and keeping current with new and anticipated technology within their area and related areas of expertiseProduce technical documentation for new and existing applicationsAssist in the conversion and loading of MS Office documents into electronic Document Control systemsAssist in daily support and troubleshooting of IT systems and data interfacesPerform other duties/projects as assignedRequired Skills: Experience in manufacturing quality systemsExperience in VB.Net, Asp.Net, C# with Python and JavaScript, SQL (SQL Server, Oracle), and IISStrong attention to detailProblem-solving skillsOrganizational skillsDemonstrated ability to manage multiple tasksObject oriented programming experienceFlexibility - Able to change and adjust smoothly as the situation demandsExcellent verbal and written communication skills; ability to effectively present informationAbility to work independently to develop, test, troubleshoot, and document quality system requirementsAbility to accurately and effectively communicate the status of tasksAbility to provide accurate estimates of the time and effort required to complete tasksDesired Skills: Experience with relational databasesGeneral Supply Chain knowledge a plusBasic work hours are 40hrs/week; 8am-5pmAdditional Information:  * No third party resumes will be accepted * CTG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of all applicable local, state, and federal laws.  * Drug testing and/or other employment-related inquiries may be conducted * All interested individuals MUST be able to work on a W2 Tax basis (no C2C or third party vendors! * Candidates must currently reside in USA or Canada * CTG is an Equal Employment Opportunity employer * CTG is an E-Verify CompanyJob Type: ContractExperience:Quality Management: 4 years (Required)Vb.Net: 4 years (Preferred)SQL: 4 years (Preferred)Location:Corning, NY (Preferred)Work authorization:United States (Required)Contract Renewal:Likely", "ContractPosition : AWS DeveloperVisa : OpenDuration : 6 months*Experience Requires : 7+ Years*Mode of Interview : Telephonic & In-Person (First round Telephonic and second In-Person Interview)Description: BS in Computer Science or related area.Around 7+ years software development experience.Should have 5+ years of experience of AWS Development / AWS Administration.Must have active current experience with Scala, Java, Python, Oracle, HBase, Hive.Experience in Cloud providers like AWS.Proficiency with agile or lean development practices.Experience with serverless architecture (i.e. AWS Lambda, containers)Strong object-oriented design and analysis skills.Excellent written and verbal communication skills.Should be able to creation of different AWS service like API, RDSinstance and Lambdato build a server less application.Experience maintaining and creating new, as needed, cloud compute instances, storage, & other cloud services required to support development team.Experience with modification of Terraform Scripts.Good Communication.AWS Certification is must.Required Skills: Dynamo DB,Mongo DB,Scala,Lambda,API’s,S3,Amazon CloudSearch,AMI Design,CloudFront,AWS Data Pipeline,Serverless builds,Scripted provisioning - Terraform or Cloud Formation,ECR,EC2,Cloud Migration,Cloud Watch,Cloud Trail,Redshift,SagemakerJob Type: ContractExperience:aws: 4 years (Required)software development: 7 years (Required)Location:New York City, NY (Required)License:AWS (Required)", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "ContractSASDeveloperNYC, NYHands on experience onSASwith Python (task is to convertSASprograms into Python / pseudo code)Experience working on business rules extraction fromSAS(business rule extraction fromSASprograms and conversion to pseudo code and working with unit testing with the SI)Automating data pipelines from multiple sources in order to run analyses and derive insightsExperience inSASBI architecture and code designExperience withSASBase,SASMacros,SASStat,SASProcedures, CreatingSASreportsExperience in Data wrangling for appropriate testingExposed to ETL, data model design, and data warehouse conceptsInsurance Property and Casualty actuarial/domain experience requiredActuary experience and nice to have certification/exam level 1 or 2 exams preferredUnderstanding of Hadoop Ecosystem – HiveJob Types: Full-time, ContractSalary: $40.00 to $50.00 /yearLocation:New York, NY (Preferred)License:Driver's License (Preferred)Work authorization:United States (Preferred)This job will require you to pass a background check:YesFull Time Opportunity:Yes", "ContractSoftware Engineers perform requirements analysis. They then design, develop or maintain the physical application (components) or the application environment, based on the Software Architecture (models and principles). Activities include coding, integrating, implementing, installing or changing frameworks and standard components, or technical and functional application management. A Software Engineer also develops languages, methods, frameworks and tools, and/or undertakes activities in support of server-based databases in development, test and production environments.Required Skills and Experience:You are an experienced Software Engineer. You have received training and mastered at least one technology environment. You are good at elaborating technology areas and have an ability to position them within the scope of an overall project. You are a member of at least one community.Qualification: Minimum 3 years experience, Bachelor’s Degree.Certification: Should have or seeking SE Level 1.Should have progressing knowledge in Business Analysis, Business Knowledge, Software Engineering, Testing, Data Management, Architecture Knowledge and Technical Solution Design.3-7 years of experience required (2 years min relevant experience in the role)Job DescriptionSeeking an innovative-minded Full Stack Software Engineer with the aptitude and ambition to learn an exciting and complex technology stack solving real-time problems at scale.The candidate needs to leverage cutting edge technologies to deliver, scale, and sustain a multitude of applications and toolsets that power our enterprise Election and News systems. The candidate will play a key role in building and maintaining our service stacks, new frontend features, be called upon to troubleshoot issues, and provide assistance to maintain existing applications and documentation.Responsibilities:· Design, implement, unit test, and deploy RESTful webservices, workflows, and APIs that power enterprise-wide systems and applications.· Work with principal engineers to implement front-end product features, and their dependencies on backend services and data.· Design and implement software components that meet product specifications, development roadmap, and the best practices in terms of supportability and maintainability.· Refactor, re-framework, and address technical debts where needed to make software applications more robust to operate and maintain, and resilient to failures.· Analyze and resolve product bugs and defects associated with frontend features, services and data.· Provide assistance to build, catalog, and maintain our internal developer portal, APIs, and developer onboarding documentation.· Maintain current knowledge of relevant current-edge technologies as assigned.· Deliver and execute tasks on sprints and milestones.Requirements:· Must have a BS or MS in Computer Science or related technical field or with equivalent practical experience.· Strong frontend experience leveraging popular web frameworks such as AngularJS, Backbone, Python Flask, etc., build tools such as Gulp, Bower, Grunt, Gradle, Maven, etc.· Backend or service level experience with Node.js and/or any one of the following OOPs: Python, Java, Scala, C/C++, or C#/.NET.· Strong development experience with RESTful webservices.· Experience with Git-based distributed version control systems such as GitHub, BitBucket, etc.· Fundamental knowledge of the HTTP and TCP/IP protocols, RESTful style, service architecture, and NoSQL/RDMS and how they work in practice.· Experience with one or more of the popular IDEs and editors such as Eclipse, Visual Studio Code, Atom, WebStorm, IntelliJ, Visual Studio, Spyder, Anaconda/Jupyter, etc.· Familiarity with operating-system-level virtualization and container technologies such as Docker, Vagrant, etc.· Experience with Agile software development methodology.Preferred qualifications:· Experience work in Linux environment and shell scripting.· Experience with distributed systems and concurrent programming.Local candidates only, no travelersJob Type: ContractExperience:NoSQL/RDMS: 2 years (Required)Node JS: 3 years (Required)distributed systems and concurrent programming: 2 years (Preferred)UI development: 4 years (Required)BUILD TOOLS: 3 years (Required)Container Technologies: 2 years (Required)Python: 3 years (Required)Linux/Unix: 2 years (Preferred)Git: 3 years (Required)Java: 3 years (Required)IDE: 2 years (Preferred)Education:Bachelor's (Required)Location:New York, NY (Required)Work authorization:United States (Required)", "ContractJob Description: Analyze business requirements and design reports using stored procedure to support business operation requirementDevelop, maintain and support SSIS Packages related to ETL Process with SQL Server Integration ServiceManages the IT project or change implementation by following System Development Lifecycle Control (SDLC) process and establishes cohesion for achieving multi-disciplinary stakeholder and project team buy-in.Daily support of implemented technology including, but not limited to banking systems, workstations and servers.Proactively provide first line support regarding to hardware, software, and network issues related to systems and be major coordinator with vendors’ support team.Monitor and respond quickly and effectively to requests received through the IT helpdeskProvide technical assistance and support for incoming concerns and issues related to systems, software and hardwareRun diagnostic problems to resolve problemsReport significant and recurring issues to the IT managementCollect feedback to determine patterns and issues such that they can be resolved or FAQs can be provided to user to ease in troubleshootingInstall and upgrade various applications and OS, Technology Level, service packsWork with SQL and T-SQL to create & alter tables, stored procedures, functions, indexing.Work with SQL for Query performance tuning, finding & resolving technical issues and develop SQL statement or reports.Perform hands-on fixes at the desktop level, including installing and upgrading software, installing hardware, and configuring systems and applications. Test fixes to ensure problem has been adequately resolved.Qualifications and Skills: Minimum 3 Years of experience as a IT system support and 2 Years of experience managing systems related to banking, financial and complianceFamiliar with Bank’s business and compliance requirement such as AML, BSA, OFAC, etc.Understand the cyber security requirement and be able to implement the security control upon the banking systems.At least 2 years of experience providing user support in an environment with Windows operating systems (Windows 7 and 10, Windows 2003/2008/2012 Servers)At least 2 years of experience with Microsoft SQL Server related productsExcellent knowledge and working experience in SQL 2012/2014 and SSISExcellent documenting work and creating ETL Design and mapping documentation is a plusAny DBA Experience in Oracle, DB2 is a plusScripting in languages such as Python and C# programing is a plusProgressive system administration experience with configuration and support of Microsoft Windows and VMware systemsMust be available for special projects, system maintenance, system upgrades, etc. after normal business hours and on weekends when required.Experience in banking business system development and maintenance is highly preferredPrevious experience with managing projects of NICE Actimize Related Products is highly preferredStrong written and oral communication skills, as well as a strong knowledge of Information Technology.Job Type: ContractExperience:IT Support: 3 years (Required)Language:Chinese (Preferred)Work authorization:United States (Required)", "ContractJob SummaryHi All,Hope you are doing well,Our company is hiring Data Scientist for one of our client in New York, NY. This is a contract opportunity.Job Title: Data ScientistLocation: New York, NYDuration: Long TermResponsibilities and DutiesRequirements: Experience in relevant areas of computer science, including data engineering, applied machine learning, deep learning, NLP or related disciplinesStrong foundation in coding skills relevant to data science/engineering, e.g., BigQuery, Python, SQL, Python, Tensorflow, CloudML, Spark, Kubernetes etc.Familiarity with modern data pipelines and ETL practices e.g. AirflowExtensive experience solving analytical problems using quantitative approachesExperience developing production-quality data products using the results of quantitative researchExperience with open source machine learning platforms e.g. tensorflow, scikit-learnExperience with cloud e.g. Google Cloud PlatformJob Type: ContractExperience:Spark: 1 year (Preferred)Kubernetes: 1 year (Preferred)Google Cloud Platform: 1 year (Preferred)Natural Language Processing: 1 year (Preferred)Quantitative Research: 1 year (Preferred)", "ContractBig Data SpecialistContract to Hire PositionW2 Only, No H1B Transfer / Sponsor , NO C2CPreferred visa status: F1 CPT / OPT EAD / EAD / GC / USCMinimum Requirements:Ability to leverage technologies such as Hadoop, Spark, HDFS, MapReduce, Hive, HBase, Python, Pig & Java.Subject matter expert of mid-range infrastructure with a focus on the Big Data platforms and technologies.Translate business goals and requirements into Big data solutions with Solid understanding of data structures, Algorithms & Design Patters.Strong experience with UNIX / Shell / Perl / Python scripting.Hands-on expertise with application design and software development in Big Data across one or more platforms, languages, and tools.Ability to provide architecture and engineering vision for the portfolio platforms.Experience in designing, developing and implementing Data Warehouse or Big Data or Data Lake solutions.Must have experience with Developing Hive QL,UDF for analyzing all semi-structured/unstructured/structured data flows.Job Type: ContractExperience:Big Data: 3 years (Preferred)Hive: 3 years (Preferred)", "ContractGovernance operationalization using Collibra DGC including architecture, design and integration with other tools.\nImplementation of Collibra DGC , Workflows and related components\nCreate and configure Collibra DGC meta-model, Assets, relationships, domains and communities\nConfigure Collibra Data Governance Center DGC based on client requirements and specifications\nDevelop Collibra dashboard and reporting requirements\nMinimum requirements\n1+ years expérience in Integrations with Collibra, Workflows, Groovy scripts\nExperience implementing Collibra –Collibra connect, MuleSoft, Integration etc\n1+ years delivering web based applications (Java/J2EE,Spring etc.)\n3+ years working as a database developer working with Python, Pycharm, ETL, and PostgreSQL\nMinimum 3 year experience with Postgresql\nMinimum 3 year experience with Python programming\nStrong in SQL, PL/pgSQL, including stored procedures, functions, triggers, and views.\nExperience with database development and ETL processes\nBuild SQL queries implementing functions, packages, views, triggers, and tables\nPerform database operations and queries using PgSQL\nProficient in Python programming with data operations\nDevelopment tools include Git, Jenkins, Bitbucket, PyCharm, Docker Compose\nProficient developing complex queries in SQL\nKnowledge of JSON and PostgreSQL support for JSON.\nAWS experience is a plus", "ContractWe invite you to explore career opportunities with Avenues International Inc.\n\nKindly send your resume to: Careers@avenuesinc.com\n\nWill lead design and development of web-based software.\n\nRequirements\n\nMust be skilled in following technologies:\nPython,\n\nDjango\n\nJavascript,\n\nAngularJS, ES6\n\nPostgreSQL\n\nRedis\n\nHeroku\n\nSCSS\n\nTwitter Bootstrap, Angular Material\n\nFilestack, New Relic APM\n\nEducation:\nA minimum of Bachelor’s Degree in computer science or a computer technology field is required\n\nJob Location\n\nNew York City, NY; Princeton NJ; Norwalk CT\nScrum Master\n\nContract to hire and Facilitator for an agile development team. Client will be a financial services company.\n\nRequirements\n\nMinimum of 2 years of experience working as an Scrum Master in most recent projects.\n\nAround 6 years of experience managing IT projects.\n\nMust have at least four years of experience in software/applications development.\n\nWorking knowledge of Atlassian tools (JIRA, Rally).\n\nStrong interpersonal skills including mentoring, coaching, collaborating, and team building.\n\nMust have excellent communications skills.\n\nJob Location\n\nNew York City, New York, USA\nSoftware Engineer\n\nDesign, deploy and support Microsoft Exchange Messaging, Enterprise Vault, Active Directory, VMWare, Blackberry/Good Technologies, McAfee Enterprise ePO, Windows Servers and SAN technologies and Subject Matter Expert (SME) for these technologies.\n\nEducation:\nA minimum of Bachelor’s Degree in computer science or a computer technology field is required\n\nJob Location\n\nPrinceton Junction, New Jersey & unanticipated client sites throughout the US\n\nData Warehouse Architect/Developer\n\nManaging complex system design, development and implementation of projects involving Oracle RDBMS.\n\nRequirements\n\nExperience in Multidimensional data modeling including STAR SCHEMA, ETL tools including Informatica or Ascential DataStage, Unix, NT, Linux, PL/SQL, SQL, C, Java, VB, Systems/Applications analysis, design and development.\n\nData Warehousing in the telecommunications sector is a plus, including experience in building Operational Data Store, integrating information, OLAP tools and metadata management.\n\nEducation:\nA minimum of Bachelor’s Degree in computer science or a computer technology field is required\n\nJob Location\n\nNorthern New Jersey, USA\n\nEOE. Individuals only, no agencies. No Visa candidates.\n\nOracle Portal Developer\n\nMake extensive use of graphing tools (J Charts and Oracle Reports) and integrate proposed solutions to Oracle Portal.\n\nRequirements\n\nDemonstrated experience with Oracle Portal.\n\nSignificant implementation experience and a proven track record in architecting and implementing successful Oracle Portal (R2 with 9IAS) and J2EE compliant web solutions.\n\nStrong proficiency in PL/SQL which is used predominantly throughout the Portal website.\n\nPreference will be given to candidates with implementation experience in Oracle Application server environments using Apache.\n\nProficiency in developing in Java/J2EE, ASP, JSP, HTML, Java Script.\n\nGeneral Unix familiarity required (shell scripting).\n\nFamiliarity with 3-tier architecture environments with MS Internet explorer, Apache/HTTP web servers, Oracle Portal, and\n\nOracle 8i/9i database.\n\nExperience implementing OID and single-sign on, integration with LDAP / Directory Services.\n\nAbility to analyze, evaluate and solve problems of a difficult process or technical nature with strong interpersonal and troubleshooting skills.\n\nEducation:\nA minimum of Bachelor’s Degree in computer science or a computer technology field is required\n\nJob Location\n\nNew Delhi, India", "ContractPosition: IBM Guardium + PERL consultantsLocation: New York Or Montreal (Might have 1-2 days remote option in a week)Duration: 6+ MonthsRoles and ResponsibilitiesThe Guardium developer role will be responsible for maintaining, developing Guardium scripts. Experience writing/maintaining Perl/Python/Power Shell scripts and very comfortable with using the command line interface (CLI)Looks like they need someone who would be good with Guardium operations. Script maintenance (existing and new scripts). They know some of the existing Perl/Python scripts will break when Guardium is upgraded to 10.5. The person would be responsible for fixing the scripts to work with 10.5Qualifications and Education RequirementsLinux scriptingPerlPythonPower ShellGuardium AdministrationExperience upgrading Guardium to 10.5Preferred skillsThe person needs a strong Guardium background. The consultant would be responsible for writing new/maintain Perl/Python/Power Shell scripts to maintain Guardium environment.PerlPythonPower ShellJob Type: ContractExperience:IBM Guardium + PERL: 1 year (Preferred)", "ContractMulesoft Developer with Cloud Experience - Urgent RequirementLocation: NYDescription:Need Sr. Mulesoft Developer with 5+ years of Experience .Anypoint Platform, API Manager, Cloudhub experienceMUnit skills/other testing tool experienceStrong knowledge of AWS – cloud technologyUnderstanding of networking fundamentalsMulesoft – create mulesoft apis on the mulesoft enterprise service busUnderstanding of Soap and Rest integration developmentGeneral Programing Background (understanding of algorithms and data structures)Languages could include, java, python, C,  * SQL and other query languagesExperience with code source control such as GitExperience with CI/CD tools such as Maven, JenkinsExperience:Aws: 3 years (Preferred)Mule: 3 years (Required)Job Type: ContractJob Type: Contract", "ContractCompany\nLogisticsExchange (LE) is a fast-paced, early stage startup focused on transforming the way B2B transportation is bought and sold. LE’s digital platform allows buyers and sellers to execute binding, enforceable contracts. Automated opportunity analytics allow members to quickly identify the best fits in their portfolio for digital LE Forwards contracts. Proprietary matching and rating algorithms ensure buyers and sellers align on critical service and performance requirements. Smart, standardized contracts and active monitoring through execution ensure contractual obligations are honored. And if either counterparty’s needs change, LE’s trading platform provides the liquidity to close out positions.\nBuilt by an experienced team with deep domain expertise, world class technical talent, and strong industry relationships, LE is backed by leading angel and venture capital investors. Having built early traction in 2017 with a set of blue chip shippers, carriers and 3PLs, the LE team is now looking to enroll additional members, expand its analytics and data science efforts, and accelerate product development.\nCome work with us to build and market the data and analytics platform that will serve as the digital foundation for contracting and trading B2B transportation. Current opportunities across our product, data science and customer success teams are based in our downtown NYC office, and require occasional travel for team meetings.\nRole\nAs a Full Stack Engineer, you will work closely together with engineers and designers to advance the development of our modern, microservices based platform, and deliver exciting new product features to our customers. You will contribute to the architectural and infrastructural design of our applications, and take on responsibility for guiding junior team members. The role will challenge you to work in a highly agile environment, address strategic and implementational topics, and work on various parts of the application stack, including the core trading services and matching engine\nResponsibilities\n\nBuild high-quality, scalable, and resilient applications and (web) services that support LE’s trading and analytics platform\nContribute to the architectural and infrastructural design of the platform and its components\nTranslate mock-ups and interpret style guides to create cohesive interfaces with modular code\nSupport design, estimation and planning of tasks using technical and functional expertise\nSupport leadership in establishing, documenting, and enforcing technology standards, best practices and approaches to be leveraged by the engineering team\nMentor and support other team members through code reviews and continuous feedback\nTake initiative to research, troubleshoot and resolve bugs and issues as they arise\nBe a flexible team player, stepping into a variety of roles, as needed\n\nQualifications\n\nStrong experience in designing and developing modern, distributed, microservices-based applications with RESTful APIs, with particular attention to security, scalability, availability, and performance\n4+ years experience in backend development with Java 8, incl. features like Streams, Serialization, Multi-Threading, Annotations\n4+ years experience in frontend development using modern JavaScript frameworks like React/Redux, Angular, Knockout, Ember, etc. (preference towards candidates with React experience)\nAdvanced knowledge of Spring/Spring Boot and ORM frameworks like Hibernate, JPA\nProfound understanding of object oriented programming and design patterns\nStrong experience in relational database design and development (preferably with PostgreSQL) and understanding of NoSQL databases and in-memory stores (e.g. Redis, DynamoDB, Hadoop)\nExperience working with event/message based communication platforms such as Kafka, ActiveMQ etc\nWorking proficiency in build and development tools (e.g. Gradle, Jenkins, SonarQube)\nExperience with test frameworks (e.g. jUnit, Mockito for Java and Jest, Enzyme for React)\nPreferred: Knowledge in cloud technologies/infrastructure (esp. AWS)\nPreferred: Prior experience in designing and developing financial systems (e.g. trading, risk, or compliance systems) and/or logistics systems\nPreferred: Experience with other languages, such as Python\nStrong analytical, project leadership and communication skills\nAbility to work both self-directed and collaboratively to deliver results in a fast paced, startup environment\nUnbelievably positive attitude, sense of humor and/or thick skin\nConsummate team player, able to wear multiple hats, and assist team members when needed\n\nHow to apply\nPlease send your resume to careers@LogisticsExchange.com", "$60,000 - $100,000 a yearPart-time, Temporary, ContractIT/Infrastructure/Design Engineering PositionSeeking an IT/Infrastructure engineer with strong knowledge of media (video/film), design, digital files/cloud infrastructures, storage/asset management, and backup solutions (LTO vaults/near line/cloud). Must also be fluent in routers, firewalls and cloud solutions, have a very knowledge of OSX, Linux, NAS/SAN maintenances/build and Network design/implementation.We are looking for a candidate that ideally is or possesses the following:- Experience with Wiring & Rack Builds. Sound Studios, Video, IT- Expert with NFS, AFP & SMB shares, read-write permission issues- Fluent in terminal, shell, SSH, rsync- Strong Sound Studio Wiring & Design Experience- Deep understanding of delivery specs and QC- Ability to oversee more than 30+ Macs, 5+ PC and some Linux- Monitor incoming and outgoing traffic & work with our internet providers- VOIP experience/Source Connect/ISDN & Mobile Hotspot- Ability to prevent unauthorized access to our network, VPN, and Firewalls- Proficient with LTO tape backups & an ability to devise backup strategies for several hundreds of TB of assets hosted on NFS shares- Outstanding troubleshooting abilities needed- Team player with a great work ethic a must* Experience with video formats (HD, 4K, HDR), Codecs and Adobe CC a huge plus.* Workflow Design a plus.* Ability to create custom computer builds a plus.* Studio security certification experience a plus.* Python, Sql, c++ a plusPlease send us your cover letter and resume. Salary based on experience.Job Types: Full-time, Part-time, Temporary, ContractSalary: $60,000.00 to $100,000.00 /year", "$30 - $50 an hourContractThe JobIncyte Studios, LLC is a software development agency specializing in the Energy Sector. Our most immediate need is for a full stack engineer with Django, Angular and Postgres experience. We are servicing a contract with a Fortune 100 energy company. Prior experience with ERP systems (SAP specifically) is a big plus.The CompanyIncyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractSalary: $30.00 to $50.00 /hourExperience:ERP/SAP: 1 year (Preferred)Python: 3 years (Required)Javascript: 2 years (Required)Django: 1 year (Required)Angular 1: 1 year (Preferred)Location:Tulsa, OK (Required)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:LikelyFull Time Opportunity:Yes", "$25 - $60 an hourContractHIRING ALL TUTORSIf you are interested in tutoring/teaching (any subject really) then please create a profile on our website: https://heytutor.com/become-a-tutor/HeyTutoris an innovative online platform that connects tutors with students. Our aim is to make it simple for tutors to find potential clients. We do this by providing an online marketplace that allows tutors to create their own profiles and browse for nearby jobs. Students can search for tutors by subject and location. Once you find a match, you can schedule lessons at a time and place that is convenient for the both of you. After lessons, tutors receive reviews and feedback fromstudents.We are currently accepting applications from qualified tutors across the United States. There are over 250 subjects available, from academic subjects to business and even life coaching.Tutor Demonstration: https://www.youtube.com/watch?v=Gw_OrbhTzbA&t=5s**Create a profile: https://heytutor.com/become-a-tutor/Keywords: MATH, SCIENCE, ENGLISH, CHEMISTRY, BIOLOGY, SAT, ACT, TEST PREP, SSAT, PSAT, MCAT, LSAT, GRE, GMAT, GEOMETRY, ALGEBRA,PREALGEBA, PRECALCULUS, CALCULUS, GEOMETRY, TEACHER, TUTOR, EDUCATOR, PROFESSOR, EDUCATION, COMPUTER SCIENCE, COMMON CORE, SKETCHUP, BIOSTATISTICS, STATISTICS, PHARMACOLOGY, MICROSOFT SUITE, MICROSOFT OUTLOOK, MICROSOFT ACCESS, MICROSOFT WORD, POWERPOINT, WRITING, READING, READING COMPREHENSION, LITERATURE, LANGUAGE ARTS, PROOFREADING, ASTRONOMY, ASTROLOGY, PHYSICS, PROBABILITY, DISCRETE MATH, FINITE MATH, R, JAVA, PYTHON, C++, RUBY ON RAILS, TRIGONOMETRY, ACCOUNTING, HISTORY, PSYCHOLOGY, QUICKBOOKS, ADOBE LIGHTROOM, ADOBE PHOTOSHOP, PUBLIC SPEAKING, FINANCE, ENGINEERING, ELEMENTARY, MIDDLE SCHOOL, HIGH SCHOOL, ISEE, TEST PREPARATION, SPECIAL EDUCATION, STAAR, GEOGRAPHY, SPANISH, ESL, FRENCH, BULGARIAN, NCLEX, DAT, PRAXISJob Type: ContractSalary: $25.00 to $60.00 /hour", "ContractContract|Looking for a SQL Programmer with a strong data and scripting background and preferred experience with tableau responsible for development, validation and analytics for a software healthcare analytics tool. Will take customer requests, figure out a solution to the problem and develop the solutions using SQL with Tableau or something similar (C++, Python, etc.). Will then automate the process to be able to use with multiple clients for future releases. Must have strong analytical and problem solving skills and be able to work in a small startup environment.Will be working with different data sets to pull out information and trends. Knowing how to Analyze andCommunicate findings is a big part of things. A strong data background is important as we work withand validate data from multiple sources.The role will be more technical in nature so experience in development and data manipulation is important.Primary Skills: SQL, Some programming knowledge (R / Python / Java), development or DW experience, Excel, Healthcare Claims, Tableau (Prefer)Experience: * Bachelor's Degree in a development or data related field* 3+ Years of Development or Data Warehouse Experience would be a plus* Healthcare claims data experience a plus,*****THIS IS A CONTRACT TO HIRE OPPORTUNITY CANDIDATE MUST BE US CITIZEN OR GREEN CARD HOLDER NO THIRD PARTY******Job Type: ContractEducation:Bachelor's (Preferred)Full Time Opportunity:Yes", "$58 - $82 an hourContract*Long Term Contract - 1 year+W2 only - (No C2C)Location: Jacksonville Beach FL (onsite)Change your lifestyle move near the beach! Jacksonville voted in the top 3 most affordable cities in the US! Cost of living calculator: https://www.nerdwallet.com/cost-of-living-calculatorHour Rate Range: $58-82 / hr W2*Onsite Sign On Bonus : $1500Job Description: Responsible for development, programming, coding of Information Technology solutions using Pythonto enable Customer Experience applications.Responsible for documentation of the system, conduct unit tests, peer code reviews andmaintenance of internally developed applications, evaluation and performancetesting of purchased products.Responsible for including IT Controls to protectthe confidentiality, integrity, as well as availability of the application anddata processed or output by the application.Mandatory Requirements: - Must have demonstrated experience developing REST APIs using Python.- Must have demonstrated experience processing batch files using Python- Must have demonstrated experience developing scheduling of batch processesDesired Skills- Be able to work independently and must be proactive- Good communication skills- Team playerJob Type: ContractExperience:Python: 4 years (Preferred)Contract Length:More than 1 year", "$50 - $75 an hourContractContractor role available for 3 months. Possibility to convert to a full time role at conclusion of 3 month contract.We are a rapidly growing NY based premier cryptocurrency Proprietary Trading and Multi-Strategy Investment Management Firm trading cryptocurrency and digital asset financial instruments.As a research driven firm, we deploy leading strategies which are informed by economic intuition, differentiated by the application of sophisticated technologies and algorithms, and managed by rigorous firm wide and strategy specific risk management models.We are charting a new path for the financial trading and investment management industry through our quantitative focus and algorithmically driven strategies in digital assets and crypto markets globally.We utilise ground-breaking strategies, cutting edge technology, and a collaboration to engage with all our trading counterparties, institutional, and HNW investors’ diverse needs.Our thought leadership enables us to continually reach beyond the limits of traditional trading firms and asset managers while operating a firm with an unparalleled commitment to transparency and excellence.Role Description:  DevOps EngineerDevOps Engineer will be working as part of a highly integrated team to develop, support, and administer a business-critical trading environment.You will be participating in an exciting blend of engineering, operational and development responsibilities with the right balance of reliability, availability, and risk management.The successful candidate thrives in an agile yet well structured environment where engineering processes are key to deliver innovative results which are aligned with the business requirements.You must be able to handle multiple on-going complex projects and be able to work independently while actively contributing as part of a highly collaborative team.Implement and maintain a computing environment that reflects your ability to deliver world class solutions for a rapidly evolving firmResearch, evaluate, implement and support various DevOps processes and platforms to support the firm’s trading platform and software development life cycle.You should be a seasoned software developer (OOP, Func)Build back-end micro-services to manage our trading data distribution, access as well as production trading environmentsHas developed and configured systems running at scale with horizontal scalingResponsibilities include, source code management, continuous integration and deployment, asset management acrossmultiple development environments on multiple operating systemsPeriodic reviews of performance, stress and capacity metrics to properly scale, size and configure computing envAutomating software integration including testing, building, packaging, and deploymentDeveloping and performing unit and integration testing as well as supporting test environmentsReview interoperability and integration points with key trading, data and counterparty systemsTroubleshooting and providing solutions for system configurationsImproving development and integration process toolsAutomating packaging of applications across OSX, Linux, and WindowsProviding production support on internally released softwareResearch, evaluate, implement and support platforms to support change management, ticketing, testing, and development initiativesWe value candidates who can work in a hands-on technical environment, thrive on learning new technologies, and have the ability to develop proficiency in new methods, standards and solutions.We believe in iterative optimisation, continuous learning, and thrive to create an inclusive environment for people from diverse backgrounds and experiences.Qualifications and CompetenciesAdvanced training in Computer Science, Software/Computer/Electrical Engineering, Mathematics or related field)5+ years of experience in cloud, DevOps, and related areas, experience in financial or crypto industry a plusPassionate about cryptocurrencies and the role they play in the future of financial marketsKnowledge of HPC message passing interfaces and librariesFamiliarity with HPC cluster and parallel grid designs, scheduling software, and grid scalingExperience and high proficiency coding and usingLinux based systems (Ubuntu, CentOS, RHEL, etc.)Hands on experience with AWS, GCP, and/or AzureDatabase technologies (SQL, NOSQLVMs and Containers (VMWare, Virtual Box, Docker, Vagrant)CI/CD and Orchestration systems (Jenkins, DevOps)Configuration & Provisioning (Puppet, Ansible, Chef, Dockerfiles)Build tools (Maven, Make)Languages and frameworks (Python, Java, C++, Javascript, Node.js, Ruby, Git)Understanding of blockchain logic and digital currencies (token dev understanding a plus)Understanding of crypto and blockchain technologies/algosProficient in technical terminology related to general cryptography and protocol languageMust have a strong understanding of compiling/building/packagingMust have knowledge of deployment scheduling, automation, and monitoring toolsKnowledge of CI best practicesAdvanced knowledge of at least one scripting language (Python preferred)Understanding and experience with DNS, SSH, SSL configurationDemonstrable experience with cloud based ETL tools (EMR, Data Pipeline, etc)A positive, team-player attitudeMust have a sense of urgency and ability to work in a fast-paced environmentWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Job Type: ContractSalary: $50.00 to $75.00 /hourContract Length:3 - 4 monthsContract Renewal:PossibleFull Time Opportunity:Yes", "ContractWe are CONSTELLATION, a remote team of growth marketers, acquisition specialists, and data analysts looking to fuel our clients' next stage of growth. You will join our Talent Network, working as a freelancer on projects that you choose. Our Project Managers handle the client relations, negotiations, scope, and project management, so you can focus on your true passion: retention.\n\nYou'll have the opportunity to work side by side best-in-class marketers, product managers, and founders of some of today’s most exciting companies. You love learning about different companies, industries, and the most up-to-date technologies, and are thrilled to see the impact of your work, watching numbers move up and to the right. At your core, what excites you most is learning, and rolling up your sleeves to make a positive impact on driving the growth of a business and playing your part on the team that does that.\n\nThe ideal candidate should be highly analytical and have a strong technical skill-set, with solid experience in a data extraction language (such as SQL and/or Python) and experience working in the Salesforce environment.\nResponsibilities:\nEnsure marketing campaign funnels and customer behavior flows are tagged and tracked accurately for reporting and analysis purposes.\nSet up standard processes, data infrastructure, operational best practices across each client’s global marketing organization\nAnalyze data, identify trends, implement optimizations on a day to day basis across digital and offline marketing channels, building dashboards and delivering timely reports to support analyses\nDevelop recommendations for changes to investment and marketing strategy, optimize the efficacy of marketing spend based on quantitative analyses\nSupport our clients’ product marketing, sales enablement, growth acquisition, and marketing automation segments on data needs and insights\nImplement technology in order to analyze sales funnel, lifetime value based on customer segmentation\n\nRequirements\n\nStrong quantitative, analytical, and problem solving skills\n4+ years experience within business/marketing/data analytics\nUnderstanding business products, journey flow and terminology\nExpertise in a query language such as SQL or equivalent\nExperience working with various digital advertising platforms, including but not limited to AdWords, Facebook, Google Analytics\nExperience in reporting on customer insights and LTV analysis\nWorking knowledge in Google Tag Manager\nWorking knowledge of ad trafficking/ad serving platforms including but not limited to Doubleclick etc.\nAbility to manage multiple projects and deliver against aggressive deadlines\nMasters Degree in Statistics, Marketing Analytics, or other Quantitative fields is highly preferable\nStrong work ethic and intellectual curiosity, with laser focus on execution\nYou’re a good fit if you are:\nHighly data-driven, with a clear understanding of data, analytics, metrics and statistics\nHave a willingness and love of learning\nHave a strong sense of ownership-comfortable driving something to completion from end-to-end; self-awareness and ability to communicate verbally and in written form\nHigh attention to detail\nPerformance and results-oriented, as well as curious, creative and in pursuit of growth\nBenefits\nYou’ll have the opportunity to work side by side best in class marketers, product managers, and even founders of some of today’s most exciting companies. You love learning about different companies, industries, and the most up to date technologies and maybe you aren’t ready to dive into just one. You’re excited to learn about different growth stacks and tools, and you’re thrilled at seeing the impact of your work, and watching numbers move up and to the right. At your core, what excites you most is learning, and rolling up your sleeves to make a positive impact on driving the growth of a business and playing your part on the team that does that.", "$60,000 - $75,000 a yearContractJob Description\n\nThe Mayor’s Office of Contract Services (MOCS) oversees and supports the procurement activities of City agencies, with a goal to ensure fairness, transparency, efficiency and cost effectiveness. The Director is the City Chief Procurement Officer. Annually, agencies procure billions in products and services from a diverse pool of vendors that represent various industries. MOCS partners with industry groups to implement policies and tools that streamline and modernize procurement, resulting in the delivery of quality services to New Yorkers. Team members operate in a fast-paced, collaborative, service-oriented environment, where flexibility and ability to achieve results are valued.\n\nThe incumbent will report to the Assistant Director of Enterprise Data Services at MOCS and with wide latitude for independent judgment will perform the following job responsibilities, which include and are not limited to:\n\nConfigure and develop SaaS products (PASSPort and IBM Cognos) to align with project specifications and documentation. Will include work to build out workflows, UI enhancements, etc. in PASSPort as well as dashboards, storyboards and reports in Cognos.Develop reports and dashboards around procurement and contracting in the City.Create efficiencies in automating reporting and analysis tasksDevelop and maintain documentation around releases (both project and maintenance).Proactively communicate with management around progress of tasks and risks.Collaborate with representatives from change management, business and integrations teams to represent the capabilities of the SaaS tools and provide input around solutions.Contribute to the presentations for management, stakeholders and executives around projects.Provide perspective and analysis of capabilities and functionality of SaaS tools he/she will be working in. He/she should have the technical knowledge to provide guidance on the feasibility and LOE of requests.Be willing to learn the business of MOCS – procurement and contracting – and provide ad hoc analysis as requested.\n\n\nMinimum Qual Requirements\n\n1. Graduation from an accredited college with a baccalaureate degree; or\n2. Graduation from an accredited community college plus two years of experience with administrative, analytic, coordinative, supervisory or liaison responsibilities; or\n3. A four year high school diploma or its educational equivalent plus four years of experience as described in “2” above; or\n4. A satisfactory equivalent combination of education and experience\n\n\nPreferred Skills\n\nA master's degree from an accredited college in economics, business or public administration, management science, operations research, organizational behavior, industrial psychology, statistics, sociology, political science, mathematics, public policy, computer science or a closely related field; with at least one (1) years of related work experience preferred but not required, or\nA baccalaureate degree from an accredited college and demonstrated equivalent expertise in a responsible supervisory, administrative or research capacity in the appropriate field of specialization, with at least three (3) years of related work experience.\nStrong quantitative and problem-solving skills; experience with empirical methods and data analytics including working with large, complex micro - data sets, building applied statistics or econometrics models, and/or conducting research.\nStrong knowledge of and experience with SQL and programming and markup languages (XML, javascript, python etc.) required.\nExperience working in configurable SaaS products strongly preferred.\nDemonstrated experience with IBM Cognos strongly preferred; familiarity with other BI tools such as PowerBI or Tableau valuable.\nFamiliarity with data models, database design, ETL development, data mining and segmentation techniques desired.\nDemonstrated ability to produce and edit documentation: e.g. Report Design Documents, mockups and prototypes etc.\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amount of information with attention to detail and accuracy.\nAbility to take initiative, prioritize duties, problem solve, work independently and within a team environment, pay close attention to detail, meet deadlines, do appropriate follow-up, work well under pressure and maintain an enthusiastic work ethic. This includes maintaining a positive and helpful attitude and a proven capacity in project management skills, including organizing and strategic planning.\nExcellent written and oral communication skills. Adept at queries, report writing, and presenting findings for business audience. Communicates effectively to non-technical teams and thrives in a dynamic environment.\nProficiency in SQL Server, MS Excel (Pivot, Advanced functions: INDEX/MATCH, VLOOKUP, HLOOKUP, etc.), MS Access, MS Project, Visio and other products in MS Suite.\nCritical and proactive thinker willing to work in dynamic environment strongly considered.\nInterest in New York City policy and operations, a plus.\n\n\nAdditional Information\n\nMayor’s Office of Contract Services is an equal opportunity employer.\nSpecial accommodations provided for applicants with disabilities.\nMayor’s Office of Contract Services recognizes the unique skills and strengths gained through military service. Veterans and service members of the U.S. Armed Forces are strongly encouraged to apply.\n\n\nTo Apply\n\nExternal Applicants, please go to www.nyc.gov/jobs and search for Job ID#: 373162.\nCurrent City Employees, please go to www.nyc.gov/ess and search for Job ID#: 373162.\n\nNo phone calls, faxes, or personal inquiries permitted.\nOnly those candidates under consideration will be contacted.\n\n\nWork Location\n\n22 Reade St, New York, NY 10007\n\n\nResidency Requirement\n\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.", "$60,000 - $75,000 a yearContractThe Mayor’s Office of Contract Services (MOCS) oversees and supports the procurement activities of City agencies, with a goal to ensure fairness, transparency, efficiency and cost effectiveness. The Director is the City Chief Procurement Officer. Annually, agencies procure billions in products and services from a diverse pool of vendors that represent various industries. MOCS partners with industry groups to implement policies and tools that streamline and modernize procurement, resulting in the delivery of quality services to New Yorkers. Team members operate in a fast-paced, collaborative, service-oriented environment, where flexibility and ability to achieve results are valued.\n\nThe incumbent will report to the Assistant Director of Enterprise Data Services at MOCS and with wide latitude for independent judgment will perform the following job responsibilities, which include and are not limited to:\n\nConfigure and develop SaaS products (PASSPort and IBM Cognos) to align with project specifications and documentation. Will include work to build out workflows, UI enhancements, etc. in PASSPort as well as dashboards, storyboards and reports in Cognos.Develop reports and dashboards around procurement and contracting in the City.Create efficiencies in automating reporting and analysis tasksDevelop and maintain documentation around releases (both project and maintenance).Proactively communicate with management around progress of tasks and risks.Collaborate with representatives from change management, business and integrations teams to represent the capabilities of the SaaS tools and provide input around solutions.Contribute to the presentations for management, stakeholders and executives around projects.Provide perspective and analysis of capabilities and functionality of SaaS tools he/she will be working in. He/she should have the technical knowledge to provide guidance on the feasibility and LOE of requests.Be willing to learn the business of MOCS – procurement and contracting – and provide ad hoc analysis as requested.\n\n\nMinimum Qual Requirements\n\n1. Graduation from an accredited college with a baccalaureate degree; or\n2. Graduation from an accredited community college plus two years of experience with administrative, analytic, coordinative, supervisory or liaison responsibilities; or\n3. A four year high school diploma or its educational equivalent plus four years of experience as described in “2” above; or\n4. A satisfactory equivalent combination of education and experience\n\n\nPreferred Skills\n\nA master's degree from an accredited college in economics, business or public administration, management science, operations research, organizational behavior, industrial psychology, statistics, sociology, political science, mathematics, public policy, computer science or a closely related field; with at least one (1) years of related work experience preferred but not required, or\nA baccalaureate degree from an accredited college and demonstrated equivalent expertise in a responsible supervisory, administrative or research capacity in the appropriate field of specialization, with at least three (3) years of related work experience.\nStrong quantitative and problem-solving skills; experience with empirical methods and data analytics including working with large, complex micro - data sets, building applied statistics or econometrics models, and/or conducting research.\nStrong knowledge of and experience with SQL and programming and markup languages (XML, javascript, python etc.) required.\nExperience working in configurable SaaS products strongly preferred.\nDemonstrated experience with IBM Cognos strongly preferred; familiarity with other BI tools such as PowerBI or Tableau valuable.\nFamiliarity with data models, database design, ETL development, data mining and segmentation techniques desired.\nDemonstrated ability to produce and edit documentation: e.g. Report Design Documents, mockups and prototypes etc.\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amount of information with attention to detail and accuracy.\nAbility to take initiative, prioritize duties, problem solve, work independently and within a team environment, pay close attention to detail, meet deadlines, do appropriate follow-up, work well under pressure and maintain an enthusiastic work ethic. This includes maintaining a positive and helpful attitude and a proven capacity in project management skills, including organizing and strategic planning.\nExcellent written and oral communication skills. Adept at queries, report writing, and presenting findings for business audience. Communicates effectively to non-technical teams and thrives in a dynamic environment.\nProficiency in SQL Server, MS Excel (Pivot, Advanced functions: INDEX/MATCH, VLOOKUP, HLOOKUP, etc.), MS Access, MS Project, Visio and other products in MS Suite.\nCritical and proactive thinker willing to work in dynamic environment strongly considered.\nInterest in New York City policy and operations, a plus.\n\n\nAdditional Information\n\nMayor’s Office of Contract Services is an equal opportunity employer.\nSpecial accommodations provided for applicants with disabilities.\nMayor’s Office of Contract Services recognizes the unique skills and strengths gained through military service. Veterans and service members of the U.S. Armed Forces are strongly encouraged to apply.\n\n\nTo Apply\n\nExternal Applicants, please go to www.nyc.gov/jobs and search for Job ID#: 373162.\nCurrent City Employees, please go to www.nyc.gov/ess and search for Job ID#: 373162.\n\nNo phone calls, faxes, or personal inquiries permitted.\nOnly those candidates under consideration will be contacted.\n\n\nWork Location\n\n22 Reade St, New York, NY 10007\n\n\nResidency Requirement\n\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.", "ContractJob SummaryTitle: Sr. VMWare Automation Engineer Work Location: New York City, NY, USAPeriod: 3 to 6 months and may extendClient-Accepted Visa Types: EAD, GC, USC,Rate: -hr on W2Responsibilities and DutiesJob Description: Participate in architectural and engineering discussions to understand business and technical objectives, following project requirements, to develop effective automation solutionsLeverage VMware vRA’s ecosystem via the ServiceNow PortalStrong familiarity with scripting (Unix Shell / PowerCLI / PowerShell / PERL / Python)Strong knowledge of virtualization technologies, specifically VMWare vSphere, ServiceNow portal with VMware vSphere and vRealize Operations ManagerInstall, configure and manage a highly available and scalable virtual infrastructure using automation techniquesProvide planning, installing, configuring, and upgrading support for vRealize Automation & vRealize OrchestratorEstablish and maintaining service levels; perform basic troubleshooting; monitor vRealize Automation & vRealize OrchestratorManage the health of the vRealize IaaS environment and perform upgrades and maintenance as outlined by the service contractStrong scripting skillsPower CLI or PowerShell ScriptingDevelop and troubleshoot Power CLI or PowerShell scriptsQualifications / Required Skill: 3-5 years’ experience developing content for vRealize Automation, ServiceNow Portal & developing PowerShell scripts for VMware Virtualized Infrastructure platform.Provide planning, installing, configuring, and upgrading support for vRealize Automation & vRealize OrchestratorEstablish and maintaining service levels; perform basic troubleshooting; monitor vRealize Automation & vRealize Orchestrator.Possess excellent written and communication skills - Great attitude and teamwork.Ability to work independently and within a teamDesirable: Working with EPIC implementation team in a Healthcare provider environmentMust-Have Primary Skill: 5+ years of expert level experience as a Technical Architect-Technical Architecture-Virtualization-VMware, Hyper V, Xen ServerJob Type: ContractExperience:Scripting: 5 years (Preferred)powershell: 5 years (Preferred)Shell Scripting: 4 years (Preferred)Archival Standards: 5 years (Preferred)IaaS: 4 years (Preferred)Epic: 4 years (Preferred)Education:High school or equivalent (Preferred)Location:New York, NY (Preferred)Work authorization:United States (Preferred)Contract Renewal:Possible", "ContractCompany\nLogisticsExchange (LE) is a fast-paced, early stage startup focused on transforming the way B2B transportation is bought and sold. LE’s digital platform allows buyers and sellers to execute binding, enforceable contracts. Automated opportunity analytics allow members to quickly identify the best fits in their portfolio for digital LE Forwards contracts. Proprietary matching and rating algorithms ensure buyers and sellers align on critical service and performance requirements. Smart, standardized contracts and active monitoring through execution ensure contractual obligations are honored. And if either counterparty’s needs change, LE’s trading platform provides the liquidity to close out positions.\nBuilt by an experienced team with deep domain expertise, world class technical talent, and strong industry relationships, LE is backed by leading angel and venture capital investors. Having built early traction in 2017 with a set of blue chip shippers, carriers and 3PLs, the LE team is now looking to enroll additional members, expand its analytics and data science efforts, and accelerate product development.\nCome work with us to build and market the data and analytics platform that will serve as the digital foundation for contracting and trading B2B transportation. Current opportunities across our product, data science and customer success teams are based in our downtown NYC office, and require occasional travel for team meetings.\nRole\nAs a Back End Engineer, you will work closely together with architects and engineers to advance the development of our modern, microservices based platform, and deliver exciting new product features to our customers. You will contribute to the architectural and infrastructural design of our applications, and leverage your experience to optimize services for performance, scalability, and security. The role will challenge you to work in a highly agile environment, address strategic and implementational topics, and work on various parts of the application stack, including the core trading services and matching engine.\nResponsibilities\n\nBuild high-quality, scalable, and resilient applications and (web) services that support LE’s trading and analytics platform\nContribute to the architectural and infrastructural design of the platform and its components\nSupport planning of tasks using technical and functional expertise\nSupport leadership in establishing, documenting, and enforcing technology standards, best practices and approaches to be leveraged by the engineering team\nMentor and support other team members through code reviews and continuous feedback\nTake initiative to research, troubleshoot and resolve bugs and issues as they arise\nBe a flexible team player, stepping into a variety of roles, as needed\n\nQualifications\n\n4+ years experience in development back ends with Java 8, incl. features like Streams, Serialization, Multi-Threading, Annotations\nAdvanced knowledge of Spring/Spring Boot and ORM frameworks like Hibernate, JPA\nStrong experience in designing and developing modern, distributed, microservices-based applications with RESTful APIs, with particular attention to security, scalability, availability, and performance\nProfound understanding of object oriented programming and design patterns\nStrong experience in relational database design and development (preferably with PostgreSQL) and understanding of NoSQL databases and in-memory stores (e.g. Redis, DynamoDB, Hadoop)\nExperience working with event/message based communication platforms such as Kafka, ActiveMQ etc\nWorking proficiency in build and development tools (e.g. Gradle, Jenkins, SonarQube)\nExperience with test frameworks (e.g. jUnit, Mockito)\nPreferred: Knowledge in cloud technologies/infrastructure (esp. AWS)\nPreferred: Prior experience in designing and developing financial systems (e.g. trading, risk, or compliance systems) and/or logistics systems\nPreferred: Experience with other languages, such as Python\nPreferred: Experience in front end development using modern JavaScript frameworks like React/Redux, Angular, Knockout, Ember, etc.\nStrong analytical, project leadership and communication skills\nAbility to work both self-directed and collaboratively to deliver results in a fast paced, startup environment\nUnbelievably positive attitude, sense of humor and/or thick skin\nConsummate team player, able to wear multiple hats, and assist team members when needed\n\nHow to apply\nPlease send your resume to careers@LogisticsExchange.com", "ContractBig Data SpecialistContract to Hire PositionW2 Only, No H1B Transfer / Sponsor , NO C2CPreferred visa status: F1 CPT / OPT EAD / EAD / GC / USCMinimum Requirements:Ability to leverage technologies such as Hadoop, Spark, HDFS, MapReduce, Hive, HBase, Python, Pig & Java.Subject matter expert of mid-range infrastructure with a focus on the Big Data platforms and technologies.Translate business goals and requirements into Big data solutions with Solid understanding of data structures, Algorithms & Design Patters.Strong experience with UNIX / Shell / Perl / Python scripting.Hands-on expertise with application design and software development in Big Data across one or more platforms, languages, and tools.Ability to provide architecture and engineering vision for the portfolio platforms.Experience in designing, developing and implementing Data Warehouse or Big Data or Data Lake solutions.Must have experience with Developing Hive QL,UDF for analyzing all semi-structured/unstructured/structured data flows.Job Type: ContractExperience:Big Data: 3 years (Preferred)Hive: 3 years (Preferred)", "ContractDeveloping and delivering business applications, API's, platforms, portals and mobile applications\nWriting code in one or more programming or scripting languages using Java, PythonSupport of Distributed Web, Client-Server and Cloud hosted applications.Support and development of Enterprise class applications that comprises of Java, .NET/C#, BPM tools, Databases(Oracle, SQL Server, Cassandra, PostgreSQL)Familiar with SSO and OAuth principles and understand how security can be implemented in the applications.Follow good coding practices and familiar with source/version control tools. (GitHub)Learning and testing new technologies, frameworks and languagesStaying abreast with new trends and advancements in web development.", "ContractShould have experience in multi environment administration in Tableau on Linux platform.Should have experience in sizing Tableau environment for High AvailabilityShould have experience setting up Disaster recovery environmentShould be able to understand & setup SAML Trusted AuthenticationShould have experience working with network & other teams setting up Load Balancers, SSL securityShould have good troubleshooting, performance tuning & sizing skillsShould have experience building & integrating R analytics with TableauShould have experience and knowledge working in Tableau latest version 2018Good to have Tableau development skillsGood to have scripting knowledge (Python/Rbuy/batch)Good to have Tableau Server certificationJob Types: Full-time, ContractContract Length:More than 1 yearContract Renewal:Likely", "ContractJob Summary*Job Role : Hadoop EngineerJob Location : New York, NYDuration : 12+ Months*Job Details: 8+ years of hands-on programming experience with 4+ years in Hadoop platform.Proficiency in data analysis and strong SQL skills.Knowledge of various components of Hadoop ecosystem and experience in applying them to practical problems – Hive/Impala/Spark-Scala/MR.Proficiency with shell scripting & Python.Experience in data warehousing, ETL tools , MPP database systems.Experience working in HIVE & Impala & creating custom UDFs and custom input/output formats /serdes.Ability to acquire, compute, store and process various types of datasets in Hadoop platform.Understanding of various Visualization platforms (Tableau).Experience with Scala.Excellent written and verbal communication skills.Job Type: ContractContract Length:1 yearContract Renewal:Possible"]}